Repository: LynxLynxx/appwrite_error_handling
Catalog: lib/l10n/intl_*.arb
Languages: ar, bn, de, es, fr, pl, pt, ru, zh

# storage_invalid_content_range
source: The content range is invalid. Please check the value of the Content-Range header
ar: نطاق المحتوى غير صالح. يرجى التحقق من قيمة رأس Content-Range
bn: কন্টেন্টের পরিসীমাটি অবৈধ। অনুগ্রহ করে Content-Range হেডারের মান পরীক্ষা করুন
de: Der Inhaltsbereich ist ungültig. Bitte überprüfe den Wert des Content-Range-Headers
es: El rango de contenido es inválido. Por favor, compruebe el valor de la cabecera Content-Range
fr: La plage de contenu est invalide. Veuillez vérifier la valeur de l'en-tête Content-Range
pl: Zakres treści jest nieprawidłowy. Sprawdź wartość nagłówka Content-Range
pt: O intervalo de conteúdo é inválido. Por favor verifique o valor do cabeçalho Content-Range
ru: Диапазон контента неверен. Пожалуйста, проверьте значение заголовка Content-Range
zh: 内容范围无效，请检查 Content-Range 标头值

# storage_invalid_appwrite_id
source: The value for x-appwrite-id header is invalid. Please check the value of the x-appwrite-id header is a valid ID and not unique()
ar: قيمة رأس x-appwrite-id غير صالحة. يرجى التحقق من أن قيمة رأس x-appwrite-id معرف صالح وليس unique()
bn: x-appwrite-id হেডারের মানটি অবৈধ। অনুগ্রহ করে x-appwrite-id হেডারের মানটি একটি বৈধ আইডি এবং unique() নয় কিনা তা পরীক্ষা করুন
de: Der Wert für den x-appwrite-id-Header ist ungültig. Bitte überprüfe, ob der Wert des x-appwrite-id-Headers eine gültige ID und kein unique() ist
es: El valor de la cabecera x-appwrite-id es inválido. Por favor, compruebe que el valor de la cabecera x-appwrite-id es una ID válida y no unique()
fr: La valeur de l'en-tête x-appwrite-id est invalide. Veuillez vérifier que la valeur de l'en-tête x-appwrite-id est un ID valide et non unique()
pl: Wartość nagłówka x-appwrite-id jest nieprawidłowa. Sprawdź, czy wartość nagłówka x-appwrite-id jest prawidłowym ID, a nie unique()
pt: O valor para o cabeçalho x-appwrite-id é inválido. Por favor verifique se o valor do cabeçalho x-appwrite-id é uma ID válida e não unique()
ru: Значение для заголовка x-appwrite-id неверно. Пожалуйста, проверьте, является ли значение заголовка x-appwrite-id действительным идентификатором, а не unique()
zh: x-appwrite-id 标头值无效，请检查 x-appwrite-id 标头的值是否为有效 ID 而不是 unique()

# storage_invalid_file
source: The uploaded file is invalid. Please check the file and try again
ar: الملف الذي تم تحميله غير صالح. يرجى التحقق من الملف وإعادة المحاولة
bn: আপলোড করা ফাইলটি অবৈধ। অনুগ্রহ করে ফাইলটি পরীক্ষা করে আবার চেষ্টা করুন
de: Die hochgeladene Datei ist ungültig. Bitte überprüfe die Datei und versuche es erneut
es: El archivo subido es inválido. Por favor, compruebe el archivo e inténtelo de nuevo
fr: Le fichier téléchargé est invalide. Veuillez vérifier le fichier et réessayer
pl: Przesłany plik jest nieprawidłowy. Sprawdź plik i spróbuj ponownie
pt: O arquivo enviado é inválido. Por favor verifique o arquivo e tente novamente
ru: Загруженный файл неверен. Пожалуйста, проверьте файл и повторите попытку
zh: 上传的文件无效，请检查文件并重新尝试

# storage_file_not_found
source: The requested file could not be found
ar: لم يتم العثور على الملف المطلوب
bn: নির্বাচিত ফাইলটি পাওয়া যায়নি
de: Die angeforderte Datei konnte nicht gefunden werden
es: No se ha podido encontrar el archivo solicitado
fr: Le fichier demandé n'a pas été trouvé
pl: Żądany plik nie został znaleziony
pt: O arquivo solicitado não foi encontrado
ru: Запрошенный файл не найден
zh: 找不到该文件

# storage_bucket_not_found
source: Storage bucket with the requested ID could not be found
ar: لم يتم العثور على دلو التخزين بالمعرف المطلوب
bn: নির্বাচিত আইডি দিয়ে স্টোরেজ বাকেটটি পাওয়া যায়নি
de: Storage-Bucket mit der angeforderten ID konnte nicht gefunden werden
es: No se ha podido encontrar el bucket de almacenamiento con la ID solicitada
fr: Le bucket de stockage avec l'identifiant demandé n'a pas été trouvé
pl: Bucket pamięci masowej z żądanym ID nie został znaleziony
pt: O bucket de armazenamento com a ID solicitada não foi encontrado
ru: Хранилище с запрошенным идентификатором не найдено
zh: 找不到该 ID 的存储桶

# storage_file_already_exists
source: A storage file with the requested ID already exists
ar: ملف التخزين بمعرف المطلوب موجود بالفعل
bn: অনুরোধ করা আইডি সহ একটি স্টোরেজ ফাইল ইতিমধ্যে বিদ্যমান
de: Eine Storage-Datei mit der angeforderten ID existiert bereits
es: Ya existe un archivo de almacenamiento con el ID solicitado
fr: Un fichier de stockage avec l'identifiant demandé existe déjà
pl: Plik przechowywania o żądanym identyfikatorze już istnieje
pt: Um arquivo de armazenamento com a ID solicitada já existe
ru: Файл хранилища с запрошенным ID уже существует
zh: 请求的 ID 已存在存储文件

# storage_bucket_already_exists
source: A storage bucket with the requested ID already exists. Try again with a different ID or use unique() to generate a unique ID
ar: دلو التخزين بمعرف المطلوب موجود بالفعل. حاول مرة أخرى بمعرف مختلف أو استخدم unique() لإنشاء معرف فريد
bn: অনুরোধ করা আইডি সহ একটি স্টোরেজ বালতি ইতিমধ্যে বিদ্যমান৷ অন্য আইডি দিয়ে আবার চেষ্টা করুন অথবা একটি অনন্য আইডি তৈরি করতে unique() ফাংশনটি ব্যবহার করুন
de: Ein Storage-Bucket mit der angeforderten ID existiert bereits. Versuchen Sie es erneut mit einer anderen ID oder verwenden Sie unique () um eine eindeutige ID zu generieren
es: Ya existe un depósito de almacenamiento con el ID solicitado. Vuelva a intentarlo con un ID diferente o use unique() para generar un ID único
fr: Un bucket de stockage avec l'identifiant demandé existe déjà. Réessayez avec un identifiant différent ou utilisez unique() pour générer un identifiant unique
pl: Kontener do przechowywania o podanym ID już istnieje. Spróbuj ponownie użyć innego ID lub funkcji unique(), aby wygenerować unikatowy identyfikator
pt: Um bucket de armazenamento com a ID solicitada já existe. Tente novamente com uma ID diferente ou use unique() para gerar uma ID única
ru: В хранилище уже существует корзина с запрошенным ID. Повторите попытку с другим ID или используйте unique() для генерации уникального ID
zh: 请求的 ID 已存在存储空间。请尝试使用不同的 ID，或使用 unique() 生成唯一 ID

# storage_invalid_range
source: The requested range is not satisfactory. Please check the value of the Range header
ar: النطاق المطلوب غير مرضي. يرجى التحقق من قيمة رأس المدى
bn: অনুরোধের পরিমাণ সন্তোষজনক নয়৷ দয়া করে Range হেডারের মানটি পরীক্ষা করুন
de: Der angeforderte Bereich ist nicht zufriedenstellend. Bitte überprüfen Sie den Wert des Range-Headers
es: El rango solicitado no es satisfactorio. Por favor, revise el valor de la cabecera Range
fr: La plage demandée n'est pas satisfaisante. Veuillez vérifier la valeur de l'en-tête Range
pl: Podany zakres jest niepoprawny. Proszę sprawdzić wartość nagłówka "Range"
pt: O intervalo solicitado não é satisfatório. Verifique o valor do cabeçalho Range
ru: Запрошенный диапазон неудовлетворителен. Проверьте значение заголовка Range
zh: 请求的范围不令人满意。请检查 Range 标头的值

# build_not_ready
source: Build with the requested ID is building and not ready for execution
ar: البنية ذات المعرف المطلوب قيد البناء وليست جاهزة للتنفيذ
bn: অনুরোধ করা আইডি সহ বিল্ডিং নির্মাণাধীন এবং কার্যকর করার জন্য প্রস্তুত নয়
de: Der Build mit der angeforderten ID wird gerade erstellt und ist noch nicht für die Ausführung bereit
es: La compilación con el ID solicitado se está construyendo y no está lista para su ejecución
fr: La construction avec l'identifiant demandé est en cours de construction et n'est pas prête à être exécutée
pl: Budowa o podanym identyfikatorze jest tworzona i nie jest jeszcze gotowa do wykonania
pt: O build com a ID solicitada está em construção e não está pronto para execução
ru: Сборка с запрошенным ID находится в процессе создания и не готова к выполнению
zh: 请求的 ID 正在构建且尚未准备好执行

# build_in_progress
source: Build with the requested ID is already in progress. Please wait before you can retry
ar: البنية ذات المعرف المطلوب قيد التقدم بالفعل. يرجى الانتظار قبل أن تتمكن من إعادة المحاولة
bn: অনুরোধ করা আইডি সহ বিল্ডিং ইতিমধ্যে চলছে৷ পুনরায় চেষ্টা করার আগে দয়া করে অপেক্ষা করুন
de: Der Build mit der angeforderten ID wird bereits ausgeführt. Bitte warten Sie, bevor Sie es erneut versuchen
es: La compilación con el ID solicitado ya está en curso. Por favor, espere antes de volver a intentarlo
fr: La construction avec l'identifiant demandé est déjà en cours. Veuillez patienter avant de pouvoir réessayer
pl: Budowa o podanym ID jest w toku. Proszę poczekać przed ponowną próbą
pt: O build com a ID solicitada já está em andamento. Aguarde antes de tentar novamente
ru: Сборка с запрошенным ID уже выполняется. Пожалуйста, подождите перед повтором попытки
zh: 请求的 ID 的构建已在进行中。请稍候再重试

# installation_not_found
source: Installation with the requested ID could not be found. Check to see if the ID is correct, or create the installation
ar: التثبيت بمعرف المطلوب لم يتم العثور عليه. تحقق لمعرفة ما إذا كان المعرف صحيحًا ، أو قم بإنشاء التثبيت
bn: অনুরোধ করা আইডি সহ ইনস্টলেশন পাওয়া যায়নি৷ আইডিটি সঠিক কিনা তা পরীক্ষা করুন অথবা ইনস্টলেশনটি তৈরি করুন
de: Installation mit der angeforderten ID konnte nicht gefunden werden. Überprüfen Sie, ob die ID korrekt ist, oder erstellen Sie die Installation
es: No se pudo encontrar la instalación con el ID solicitado. Comprueba si el ID es correcto o crea la instalación
fr: L'installation avec l'identifiant demandé n'a pas pu être trouvée. Vérifiez si l'identifiant est correct ou créez l'installation
pl: Instalacja o podanym identyfikatorze nie została znaleziona. Sprawdź poprawność ID lub utwórz instalację
pt: A instalação com a ID solicitada não foi encontrada. Verifique se a ID está correta ou crie a instalação
ru: Установка с запрошенным ID не найдена. Проверьте, правильный ли ID, или создайте установку
zh: 无法找到请求的 ID 的安装。检查 ID 是否正确，或创建安装

# provider_repository_not_found
source: VCS (Version Control System) repository with the requested ID could not be found. Check to see if the ID is correct, and if it belongs to installationId you provided
ar: لم يتم العثور على مستودع VCS (نظام التحكم في الإصدارات) بمعرف المطلوب. تحقق لمعرفة ما إذا كان المعرف صحيحًا ، وإذا كان ينتمي إلى installationId الذي قدمته
bn: অনুরোধ করা আইডি সহ VCS (সংস্করণ নিয়ন্ত্রণ সিস্টেম) রিপোজিটরি পাওয়া যায়নি৷ আইডিটি সঠিক কিনা এবং এটি আপনার প্রদত্ত installationId-এর অন্তর্ভুক্ত কিনা তা পরীক্ষা করুন
de: Das VCS-Repository (Version Control System) mit der angeforderten ID konnte nicht gefunden werden. Überprüfen Sie, ob die ID korrekt ist und ob sie zu der von Ihnen angegebenen Installations-ID gehört
es: No se pudo encontrar el repositorio VCS (Sistema de Control de Versiones) con el ID solicitado. Comprueba si el ID es correcto y si pertenece a la installationId que has proporcionado
fr: Le référentiel VCS (Version Control System) avec l'identifiant demandé n'a pas pu être trouvé. Vérifiez si l'identifiant est correct et s'il appartient à l'installation que vous avez fournie
pl: Repozytorium VCS (system kontroli wersji) o podanym identyfikatorze nie zostało znalezione. Sprawdź poprawność identyfikatora i czy należy do podanego instalacji
pt: O repositório VCS (Version Control System) com a ID solicitada não foi encontrado. Verifique se a ID está correta e se ela pertence à installationId fornecida
ru: Репозиторий VCS (Version Control System) с запрошенным ID не найден. Проверьте, правильный ли ID, и принадлежит ли он указанному вами ID установки
zh: 无法找到请求的 ID 的 VCS（版本控制系统）存储库。检查 ID 是否正确，以及它是否属于您提供的 installationId

# repository_not_found
source: Repository with the requested ID could not be found. Check to see if the ID is correct, or create the repository
ar: لم يتم العثور على المستودع بمعرف المطلوب. تحقق لمعرفة ما إذا كان المعرف صحيحًا ، أو قم بإنشاء المستودع
bn: অনুরোধ করা আইডি সহ রিপোজিটরি পাওয়া যায়নি৷ আইডিটি সঠিক কিনা তা পরীক্ষা করুন অথবা রিপোজিটরিটি তৈরি করুন
de: Repository mit der angeforderten ID konnte nicht gefunden werden. Überprüfen Sie, ob die ID korrekt ist, oder erstellen Sie das Repository
es: No se pudo encontrar el repositorio con el ID solicitado. Comprueba si el ID es correcto o crea el repositorio
fr: Le référentiel avec l'identifiant demandé n'a pas pu être trouvé. Vérifiez si l'identifiant est correct ou créez le référentiel
pl: Repozytorium o podanym identyfikatorze nie zostało znalezione. Sprawdź poprawność identyfikatora lub utwórz repozytorium
pt: O repositório com a ID solicitada não foi encontrado. Verifique se a ID está correta ou crie o repositório
ru: Репозиторий с запрошенным ID не найден. Проверьте, правильный ли ID, или создайте репозиторий
zh: 无法找到请求的 ID 的存储库。检查 ID 是否正确，或创建存储库

# function_not_found
source: Function with the requested ID could not be found
ar: لم يتم العثور على دالة بمعرف المطلوب
bn: অনুরোধ করা আইডি সহ ফাংশন পাওয়া যায়নি
de: Funktion mit der angeforderten ID konnte nicht gefunden werden
es: No se pudo encontrar la función con el ID solicitado
fr: La fonction avec l'identifiant demandé n'a pas pu être trouvée
pl: Funkcja o podanym ID nie została znaleziona
pt: A função com a ID solicitada não foi encontrada
ru: Функция с запрошенным ID не найдена
zh: 无法找到请求的 ID 的函数

# function_runtime_unsupported
source: The requested runtime is either inactive or unsupported. Please check the value of the _APP_FUNCTIONS_RUNTIMES environment variable
ar: وقت التشغيل المطلوب غير نشط أو غير مدعوم. يرجى التحقق من قيمة متغير البيئة _APP_FUNCTIONS_RUNTIMES
bn: অনুরোধ করা রানটাইমটি নিষ্ক্রিয় অথবা সমর্থিত নয়৷ দয়া করে _APP_FUNCTIONS_RUNTIMES পরিবেশ ভেরিয়েবলের মানটি পরীক্ষা করুন
de: Die angeforderte Runtime ist entweder inaktiv oder wird nicht unterstützt. Bitte überprüfen Sie den Wert der Umgebungsvariablen _APP_FUNCTIONS_RUNTIMES
es: El tiempo de ejecución solicitado está inactivo o no es compatible. Comprueba el valor de la variable de entorno _APP_FUNCTIONS_RUNTIMES
fr: Le runtime demandé est inactif ou non pris en charge. Veuillez vérifier la valeur de la variable d'environnement _APP_FUNCTIONS_RUNTIMES
pl: Podane środowisko wykonawcze jest nieaktywne lub nieobsługiwane. Sprawdź wartość zmiennej środowiskowej _APP_FUNCTIONS_RUNTIMES
pt: O tempo de execução solicitado está inativo ou não é suportado. Verifique o valor da variável de ambiente _APP_FUNCTIONS_RUNTIMES
ru: Запрошенная среда выполнения неактивна или не поддерживается. Проверьте значение переменной среды _APP_FUNCTIONS_RUNTIMES
zh: 请求的运行时已停用或不受支持。请检查 _APP_FUNCTIONS_RUNTIMES 环境变量的值

# function_entrypoint_missing
source: Entrypoint for your Appwrite Function is missing. Please specify it when making deployment or update the entrypoint under your function's Settings > Configuration > Entrypoint
ar: نقطة الدخول لوظيفة Appwrite مفقودة. يرجى تحديدها عند إجراء النشر أو تحديث نقطة الدخول تحت إعدادات الوظيفة > التكوين > نقطة الدخول
bn: আপনার অ্যাপরাইট ফাংশনের এন্ট্রিপয়েন্ট অনুপস্থিত৷ ডেপ্লয়মেন্ট করার সময় বা আপনার ফাংশনের সেটিংস > কনফিগারেশন > এন্ট্রিপয়েন্টের অধীনে এন্ট্রিপয়েন্ট আপডেট করার সময় এটি নির্দিষ্ট করুন
de: Der Einstiegspunkt für Ihre Appwrite-Funktion fehlt. Bitte geben Sie ihn bei der Bereitstellung an oder aktualisieren Sie den Einstiegspunkt unter Einstellungen > Konfiguration > Einstiegspunkt Ihrer Funktion
es: Falta el punto de entrada para tu función Appwrite. Por favor, especifícalo al realizar el despliegue o actualiza el punto de entrada en la configuración de tu función > Ajustes > Configuración > Punto de entrada
fr: Le point d'entrée de votre fonction Appwrite est manquant. Veuillez le spécifier lors du déploiement ou le mettre à jour sous Paramètres > Configuration > Point d'entrée de votre fonction
pl: Brak punktu wejścia dla Twojej funkcji Appwrite. Określ go podczas tworzenia wdrożenia lub zaktualizuj punkt wejścia w sekcji Ustawienia > Konfiguracja > Punkt wejścia
pt: O ponto de entrada para sua função Appwrite está faltando. Especifique-o ao fazer a implantação ou atualize o ponto de entrada em Configurações > Configuração > Ponto de entrada da sua função
ru: Отсутствует точка входа для вашей функции Appwrite. Укажите ее при развертывании или обновите точку входа в разделе Настройки > Конфигурация > Точка входа
zh: 您的 Appwrite 函数缺少入口点。请在进行部署或更新入口点时指定入口点，方法是进入函数的设置 > 配置 > 入口点

# build_not_found
source: Build with the requested ID could not be found
ar: لم يتم العثور على البنية بمعرف المطلوب
bn: অনুরোধ করা আইডি সহ বিল্ডিং পাওয়া যায়নি
de: Der Build mit der angeforderten ID konnte nicht gefunden werden
es: No se pudo encontrar la compilación con el ID solicitado
fr: La construction avec l'identifiant demandé n'a pas pu être trouvée
pl: Budowa o podanym ID nie została znaleziona
pt: O build com a ID solicitada não foi encontrado
ru: Сборка с запрошенным ID не найдена
zh: 无法找到请求的 ID 的构建

# deployment_not_found
source: Deployment with the requested ID could not be found
ar: لم يتم العثور على النشر بمعرف المطلوب
bn: অনুরোধ করা আইডি সহ ডেপ্লয়মেন্ট পাওয়া যায়নি
de: Die Bereitstellung mit der angeforderten ID konnte nicht gefunden werden
es: No se pudo encontrar el despliegue con el ID solicitado
fr: Le déploiement avec l'identifiant demandé n'a pas pu être trouvé
pl: Wdrożenie o podanym ID nie zostało znalezione
pt: A implantação com a ID solicitada não foi encontrada
ru: Развертывание с запрошенным ID не найдено
zh: 无法找到请求的 ID 的部署

# variable_not_found
source: Variable with the requested ID could not be found
ar: لم يتم العثور على متغير بمعرف المطلوب
bn: অনুরোধ করা আইডি সহ ভেরিয়েবল পাওয়া যায়নি
de: Variable mit der angeforderten ID konnte nicht gefunden werden
es: No se pudo encontrar la variable con el ID solicitado
fr: La variable avec l'identifiant demandé n'a pas pu être trouvée
pl: Zmienna o podanym ID nie została znaleziona
pt: A variável com a ID solicitada não foi encontrada
ru: Переменная с запрошенным ID не найдена
zh: 无法找到请求的 ID 的变量

# provider_contribution_conflict
source: External contribution is already authorized
ar: المساهمة الخارجية مصرح بها بالفعل
bn: বাহ্যিক অবদান ইতিমধ্যে অনুমোদিত হয়েছে
de: Externe Beiträge sind bereits autorisiert
es: La contribución externa ya está autorizada
fr: La contribution externe est déjà autorisée
pl: Dostęp zewnętrzny jest już autoryzowany
pt: A contribuição externa já está autorizada
ru: Внешний вклад уже авторизован
zh: 外部贡献已授权

# variable_already_exists
source: Variable with the same ID already exists in this project. Try again with a different ID
ar: المتغير الذي يحمل نفس المعرف موجود بالفعل في هذا المشروع. حاول مرة أخرى بمعرف مختلف
bn: এই প্রকল্পে একই আইডি সহ ভেরিয়েবল ইতিমধ্যে বিদ্যমান৷ অন্য আইডি দিয়ে আবার চেষ্টা করুন
de: Eine Variable mit der gleichen ID existiert bereits in diesem Projekt. Versuchen Sie es erneut mit einer anderen ID
es: Ya existe una variable con el mismo ID en este proyecto. Vuelve a intentarlo con un ID diferente
fr: Une variable avec le même identifiant existe déjà dans ce projet. Réessayez avec un identifiant différent
pl: Zmienna o tym samym identyfikatorze już istnieje w tym projekcie. Spróbuj ponownie użyć innego identyfikatora
pt: Uma variável com a mesma ID já existe neste projeto. Tente novamente com uma ID diferente
ru: Переменная с тем же ID уже существует в этом проекте. Попробуйте использовать другой ID
zh: 此项目中已存在具有相同 ID 的变量。请尝试使用不同的 ID

# avatar_set_not_found
source: The requested avatar set could not be found
ar: لم يتم العثور على مجموعة الصور الرمزية المطلوبة
bn: অনুরোধ করা অবতার সেট পাওয়া যায়নি
de: Das angeforderte Avatar-Set konnte nicht gefunden werden
es: No se pudo encontrar el conjunto de avatares solicitado
fr: L'ensemble d'avatars demandé n'a pas pu être trouvé
pl: Podany zestaw awatarów nie został znaleziony
pt: O conjunto de avatares solicitado não foi encontrado
ru: Запрашиваемый набор аватаров не найден
zh: 找不到请求的头像集

# avatar_not_found
source: The request avatar could not be found
ar: لم يتم العثور على الصورة الرمزية المطلوبة
bn: অনুরোধ করা অবতার পাওয়া যায়নি
de: Das angeforderte Avatar konnte nicht gefunden werden
es: No se pudo encontrar el avatar solicitado
fr: L'avatar demandé n'a pas pu être trouvé
pl: Podany awatar nie został znaleziony
pt: O avatar solicitado não foi encontrado
ru: Запрашиваемый аватар не найден
zh: 找不到请求的头像

# avatar_image_not_found
source: The requested image was not found at the URL
ar: لم يتم العثور على الصورة المطلوبة في عنوان URL
bn: অনুরোধ করা ইমেজটি URL-এ পাওয়া যায়নি
de: Das angeforderte Bild wurde unter der URL nicht gefunden
es: La imagen solicitada no se encontró en la URL
fr: L'image demandée n'a pas été trouvée à l'URL
pl: Podany obraz nie został znaleziony pod danym adresem URL
pt: A imagem solicitada não foi encontrada na URL
ru: Запрашиваемое изображение не найдено по указанному URL.
zh: 在 URL 处找不到请求的图像

# avatar_remote_url_failed
source: Failed to fetch favicon from the requested URL
ar: فشل في جلب الرمز من عنوان URL المطلوب
bn: অনুরোধ করা URL থেকে ফেভিকন আনতে ব্যর্থ হয়েছে
de: Favicon konnte nicht von der angegebenen URL abgerufen werden
es: No se pudo obtener el favicon de la URL solicitada
fr: Échec de la récupération de la favicon à partir de l'URL demandée
pl: Nie udało się pobrać awatara z podanego adresu URL
pt: Falha ao buscar o favicon da URL solicitada
ru: Не удалось получить favicon с указанного URL
zh: 无法从请求的 URL 获取 favicon

# avatar_icon_not_found
source: The requested favicon could not be found
ar: لم يتم العثور على الرمز المطلوب
bn: অনুরোধ করা ফেভিকন পাওয়া যায়নি
de: Das angeforderte Favicon konnte nicht gefunden werden
es: No se pudo encontrar el favicon solicitado
fr: La favicon demandée n'a pas pu être trouvée
pl: Nie znaleziono awatara
pt: O favicon solicitado não foi encontrado
ru: Запрашиваемая favicon не найдена
zh: 找不到请求的 favicon

# typeError
source: Sorry, there was an error processing your request. It seems that an object couldn't be transformed into the expected class or model. Please check your input and try again
ar: عفواً، حدث خطأ أثناء معالجة طلبك. يبدو أن الكائن لا يمكن تحويله إلى النوع أو النموذج المتوقع. يرجى التحقق من إدخالك والمحاولة مرة أخرى.
bn: দুঃখিত, আপনার অনুরোধটি প্রক্রিয়া করার সময় একটি ত্রুটি হয়েছে। মনে হচ্ছে কোনও বস্তুকে প্রত্যাশিত শ্রেণী বা মডেলে রূপান্তর করা যায়নি। দয়া করে আপনার ইনপুটটি পরীক্ষা করে আবার চেষ্টা করুন।
de: Es ist ein Fehler beim Verarbeiten Ihrer Anfrage aufgetreten. Offenbar konnte ein Objekt nicht in die erwartete Klasse oder das erwartete Modell transformiert werden. Überprüfen Sie bitte Ihre Eingabe und versuchen Sie es erneut.
es: Lo sentimos, se produjo un error al procesar su solicitud. Parece que un objeto no se pudo transformar en la clase o modelo esperado. Compruebe su entrada y vuelva a intentarlo.
fr: Désolé, une erreur s'est produite lors du traitement de votre requête. Il semble qu'un objet n'a pas pu être transformé dans la classe ou le modèle attendu. Veuillez vérifier votre saisie et réessayer.
pl: Przepraszamy, wystąpił błąd podczas przetwarzania Twojego żądania. Wygląda na to, że obiektu nie można przekonwertować na oczekiwaną klasę lub model. Sprawdź swoje dane wejściowe i spróbuj ponownie
pt: Desculpe, ocorreu um erro ao processar sua solicitação. Parece que um objeto não pôde ser transformado na classe ou modelo esperado. Verifique sua entrada e tente novamente
ru: Извините, при обработке вашего запроса возникла ошибка. Похоже, объект не удалось преобразовать в ожидаемый класс или модель. Проверьте свои входные данные и повторите попытку
zh: 对不起，处理您的请求时出错。似乎无法将对象转换为预期的类或模型。请检查您的输入并重试。
