Repository: LynxLynxx/appwrite_error_handling
Catalog: lib/l10n/intl_*.arb
Languages: ar, bn, de, es, fr, pl, pt, ru, zh

# user_auth_method_unsupported
source: The requested authentication method is either disabled or unsupported. Please check the supported authentication methods in the Appwrite console
ar: طريقة المصادقة المطلوبة إما معطلة أو غير مدعومة. يرجى التحقق من طرق المصادقة المدعومة في وحدة تحكم Appwrite
bn: নির্বাচিত প্রমাণীকরণ পদ্ধতিটি নিষ্ক্রিয় বা সমর্থিত নয়। অনুগ্রহ করে Appwrite কনসোলে সমর্থিত প্রমাণীকরণ পদ্ধতিগুলি পরীক্ষা করুন
de: Die angeforderte Authentifizierungsmethode ist entweder deaktiviert oder wird nicht unterstützt. Bitte überprüfe die unterstützten Authentifizierungsmethoden in der Appwrite-Konsole
es: El método de autenticación solicitado está desactivado o no es compatible. Por favor, revise los métodos de autenticación soportados en la consola de Appwrite
fr: La méthode d'authentification demandée est désactivée ou non prise en charge. Veuillez vérifier les méthodes d'authentification prises en charge dans la console Appwrite
pl: Żądana metoda uwierzytelniania jest wyłączona lub nieobsługiwana. Sprawdź obsługiwane metody uwierzytelniania w konsoli Appwrite
pt: O método de autenticação solicitado está desabilitado ou não é suportado. Por favor verifique os métodos de autenticação suportados no console Appwrite
ru: Запрошенный метод аутентификации либо отключен, либо не поддерживается. Пожалуйста, проверьте поддерживаемые методы аутентификации в консоли Appwrite
zh: 您所选的认证方式已被禁用或不支持。请在 Appwrite 控制面板检查支持的认证方式

# collection_limit_exceeded
source: The maximum number of collections has been reached
ar: تم الوصول إلى الحد الأقصى لعدد المجموعات
bn: সংগ্রহের সর্বোচ্চ সংখ্যাটিতে পৌঁছে গেছে
de: Die maximale Anzahl an Sammlungen wurde erreicht
es: Se ha alcanzado el número máximo de colecciones
fr: Le nombre maximal de collections a été atteint
pl: Osiągnięto maksymalną liczbę kolekcji
pt: O número máximo de coleções foi alcançado
ru: Достигнуто максимальное количество коллекций
zh: 已达到最大集合数限制

# document_invalid_structure
source: The document structure is invalid. Please ensure the attributes match the collection definition
ar: هيكل المستند غير صالح. يرجى التأكد من أن السمات تتطابق مع تعريف المجموعة
bn: দলিলটির গঠনটি অবৈধ। অনুগ্রহ করে নিশ্চিত করুন যে বৈশিষ্ট্যগুলি সংগ্রহ সংজ্ঞার সাথে মিলে যায়
de: Die Dokumentstruktur ist ungültig. Bitte stelle sicher, dass die Attribute mit der Sammlungsdefinition übereinstimmen
es: La estructura del documento es inválida. Por favor, asegúrese de que los atributos coinciden con la definición de la colección
fr: La structure du document est invalide. Veuillez vous assurer que les attributs correspondent à la définition de la collection
pl: Struktura dokumentu jest nieprawidłowa. Upewnij się, że atrybuty odpowiadają definicji kolekcji
pt: A estrutura do documento é inválida. Por favor certifique-se que os atributos correspondem à definição da coleção
ru: Структура документа неверна. Пожалуйста, убедитесь, что атрибуты соответствуют определению коллекции
zh: 文档结构无效，请确保所有属性都符合集合定义

# document_missing_data
source: The document data is missing. Try again with document data populated
ar: بيانات المستند مفقودة. أعد المحاولة مع ملء بيانات المستند
bn: দলিলের ডেটাটি অনুপস্থিত। দলিলের ডেটা প্রদান করে আবার চেষ্টা করুন
de: Die Dokumentdaten fehlen. Versuche es erneut mit ausgefüllten Dokumentdaten
es: Faltan los datos del documento. Inténtelo de nuevo con los datos del documento rellenados
fr: Les données du document sont manquantes. Réessayez avec les données du document remplies
pl: Brakuje danych dokumentu. Spróbuj ponownie z wypełnionymi danymi dokumentu
pt: Os dados do documento estão faltando. Tente novamente com os dados do documento preenchidos
ru: Отсутствуют данные документа. Повторите попытку с заполненными данными документа
zh: 文档数据缺失，请重新填充文档数据

# document_missing_payload
source: The document data and permissions are missing. You must provide either document data or permissions to be updated
ar: بيانات المستند والأذونات مفقودة. يجب تقديم بيانات المستند أو أذونات للتحديث
bn: দলিলের ডেটা এবং অনুমোদনগুলি অনুপস্থিত। আপনাকে অবশ্যই আপডেট করার জন্য দলিলের ডেটা বা অনুমোদনগুলি প্রদান করতে হবে
de: Die Dokumentdaten und Berechtigungen fehlen. Du musst entweder Dokumentdaten oder zu aktualisierende Berechtigungen angeben
es: Faltan los datos y permisos del documento. Debe proporcionar los datos del documento o los permisos que se van a actualizar
fr: Les données et les autorisations du document sont manquantes. Vous devez fournir les données du document ou les autorisations à mettre à jour
pl: Brakuje danych dokumentu i uprawnień. Musisz podać dane dokumentu lub uprawnienia, które mają zostać zaktualizowane
pt: Os dados do documento e as permissões estão faltando. Você deve fornecer dados do documento ou permissões para serem atualizados
ru: Отсутствуют данные документа и разрешения. Необходимо предоставить данные документа или разрешения для обновления
zh: 文档数据和权限都缺失，您必须提供要更新的文档数据或权限

# attribute_unknown
source: The attribute required for the index could not be found. Please confirm all your attributes are in the available state
ar: لم يتم العثور على السمة المطلوبة للمؤشر. يرجى تأكيد أن جميع سماتك في حالة متاحة
bn: সূচকটির জন্য প্রয়োজনীয় বৈশিষ্ট্যটি পাওয়া যায়নি। অনুগ্রহ করে নিশ্চিত করুন যে আপনার সমস্ত বৈশিষ্ট্যগুলি উপলব্ধ অবস্থায় রয়েছে
de: Das für den Index benötigte Attribut konnte nicht gefunden werden. Bitte bestätige, dass alle deine Attribute im verfügbaren Zustand sind
es: No se ha podido encontrar el atributo requerido para el índice. Por favor, confirme que todos sus atributos están en estado disponible
fr: L'attribut requis pour l'index n'a pas été trouvé. Veuillez confirmer que tous vos attributs sont à l'état disponible
pl: Atrybut wymagany dla indeksu nie został znaleziony. Sprawdź, czy wszystkie atrybuty są w stanie dostępnym
pt: O atributo requerido para o índice não pôde ser encontrado. Por favor confirme que todos os seus atributos estão disponíveis
ru: Не удалось найти атрибут, требуемый для индекса. Пожалуйста, убедитесь, что все ваши атрибуты находятся в доступном состоянии
zh: 无法找到索引所需的属性，请确认所有属性都处于可用状态

# attribute_not_available
source: The requested attribute is not yet available. Please try again later
ar: السمة المطلوبة غير متوفرة بعد. يرجى المحاولة مرة أخرى لاحقًا
bn: নির্বাচিত বৈশিষ্ট্যটি এখনও উপলব্ধ নয়। অনুগ্রহ করে পরে আবার চেষ্টা করুন
de: Das angeforderte Attribut ist noch nicht verfügbar. Bitte versuche es später erneut
es: El atributo solicitado aún no está disponible. Por favor, inténtelo de nuevo más tarde
fr: L'attribut demandé n'est pas encore disponible. Veuillez réessayer plus tard
pl: Żądany atrybut nie jest jeszcze dostępny. Spróbuj ponownie później
pt: O atributo solicitado ainda não está disponível. Por favor tente novamente mais tarde
ru: Запрошенный атрибут еще не доступен. Пожалуйста, попробуйте позже
zh: 该属性目前不可用，请稍后再试

# attribute_format_unsupported
source: The requested attribute format is not supported
ar: تنسيق السمة المطلوب غير مدعوم
bn: নির্বাচিত বৈশিষ্ট্যের ফর্ম্যাটটি সমর্থিত নয়
de: Das angeforderte Attributformat wird nicht unterstützt
es: El formato de atributo solicitado no es compatible
fr: Le format d'attribut demandé n'est pas pris en charge
pl: Żądany format atrybutu nie jest obsługiwany
pt: O formato de atributo solicitado não é suportado
ru: Запрошенный формат атрибута не поддерживается
zh: 不支持该属性格式

# attribute_default_unsupported
source: Default values cannot be set for array or required attributes
ar: لا يمكن تعيين قيم افتراضية للمصفوفة أو السمات المطلوبة
bn: অ্যারে বা প্রয়োজনীয় বৈশিষ্ট্যগুলির জন্য ডিফল্ট মান সেট করা যায় না
de: Für Array- oder benötigte Attribute können keine Standardwerte festgelegt werden
es: No se pueden establecer valores por defecto para los atributos de matriz o requeridos
fr: Les valeurs par défaut ne peuvent pas être définies pour les attributs de tableau ou requis
pl: Nie można ustawić wartości domyślnych dla tablic lub atrybutów wymaganych
pt: Valores padrão não podem ser configurados para atributos de array ou obrigatórios
ru: Значения по умолчанию не могут быть установлены для массивов или обязательных атрибутов
zh: 无法为数组或必填属性设置默认值

# attribute_limit_exceeded
source: The maximum number of attributes has been reached
ar: تم الوصول إلى الحد الأقصى لعدد السمات
bn: বৈশিষ্ট্যগুলির সর্বোচ্চ সংখ্যাটিতে পৌঁছে গেছে
de: Die maximale Anzahl an Attributen wurde erreicht
es: Se ha alcanzado el número máximo de atributos
fr: Le nombre maximal d'attributs a été atteint
pl: Osiągnięto maksymalną liczbę atrybutów
pt: O número máximo de atributos foi alcançado
ru: Достигнуто максимальное количество атрибутов
zh: 已达到最大属性数限制

# attribute_value_invalid
source: The attribute value is invalid. Please check the type, range and value of the attribute
ar: قيمة السمة غير صالحة. يرجى التحقق من نوع ومجال وقيمة السمة
bn: বৈশিষ্ট্যের মানটি অবৈধ। অনুগ্রহ করে বৈশিষ্ট্যের টাইপ, পরিসীমা এবং মান পরীক্ষা করুন
de: Der Attributwert ist ungültig. Bitte überprüfe den Typ, den Bereich und den Wert des Attributs
es: El valor del atributo es inválido. Por favor, compruebe el tipo, el rango y el valor del atributo
fr: La valeur de l'attribut est invalide. Veuillez vérifier le type, la plage et la valeur de l'attribut
pl: Wartość atrybutu jest nieprawidłowa. Sprawdź typ, zakres i wartość atrybutu
pt: O valor do atributo é inválido. Por favor verifique o tipo, intervalo e valor do atributo
ru: Значение атрибута неверно. Пожалуйста, проверьте тип, диапазон и значение атрибута
zh: 该属性值无效，请检查属性的类型、范围和值

# attribute_type_invalid
source: The attribute type is invalid
ar: نوع السمة غير صالح
bn: বৈশিষ্ট্যের টাইপটি অবৈধ
de: Der Attributtyp ist ungültig
es: El tipo de atributo es inválido
fr: Le type d'attribut est invalide
pl: Typ atrybutu jest nieprawidłowy
pt: O tipo de atributo é inválido
ru: Тип атрибута неверен
zh: 该属性类型无效

# index_limit_exceeded
source: The maximum number of indexes has been reached
ar: تم الوصول إلى الحد الأقصى لعدد المؤشرات
bn: সূচকগুলির সর্বোচ্চ সংখ্যাটিতে পৌঁছে গেছে
de: Die maximale Anzahl an Indizes wurde erreicht
es: Se ha alcanzado el número máximo de índices
fr: Le nombre maximal d'index a été atteint
pl: Osiągnięto maksymalną liczbę indeksów
pt: O número máximo de índices foi alcançado
ru: Достигнуто максимальное количество индексов
zh: 已达到最大索引数限制

source: Index invalid
ar: مؤشر غير صالح
bn: সূচকটি অবৈধ
de: Index ungültig
es: Índice inválido
fr: Index invalide
pl: Indeks jest nieprawidłowy
pt: Índice inválido
ru: Индекс неверен
zh: 索引无效

# document_delete_restricted
source: Document cannot be deleted because it is referenced by another document
ar: لا يمكن حذف المستند لأنه يشير إليه مستند آخر
bn: দলিলটি মুছে ফেলা যায় না কারণ এটি অন্য একটি দলিল দ্বারা উল্লেখ করা হয়েছে
de: Dokument kann nicht gelöscht werden, da es von einem anderen Dokument referenziert wird
es: El documento no se puede eliminar porque está referenciado por otro documento
fr: Le document ne peut pas être supprimé car il est référencé par un autre document
pl: Dokument nie może zostać usunięty, ponieważ jest on referencjonowany przez inny dokument
pt: O documento não pode ser deletado porque está sendo referenciado por outro documento
ru: Документ не может быть удален, поскольку на него ссылается другой документ
zh: 无法删除该文档，因为它被其他文档引用

# execution_not_found
source: Execution with the requested ID could not be found
ar: لم يتم العثور على التنفيذ بالمعرف المطلوب
bn: নির্বাচিত আইডি দিয়ে নিष्पादনটি পাওয়া যায়নি
de: Ausführung mit der angeforderten ID konnte nicht gefunden werden
es: No se ha podido encontrar la ejecución con la ID solicitada
fr: L'exécution avec l'identifiant demandé n'a pas été trouvée
pl: Wykonanie z żądanym ID nie zostało znalezione
pt: A execução com a ID solicitada não foi encontrada
ru: Выполнение с запрошенным идентификатором не найдено
zh: 找不到该 ID 的执行

source: Database not found
ar: قاعدة البيانات غير موجودة
bn: ডেটাবেস পাওয়া যায়নি
de: Datenbank nicht gefunden
es: Base de datos no encontrada
fr: Base de données non trouvée
pl: Baza danych nie została znaleziona
pt: Banco de dados não encontrado
ru: База данных не найдена
zh: 数据库不存在

# collection_not_found
source: Collection with the requested ID could not be found
ar: لم يتم العثور على مجموعة بالمعرف المطلوب
bn: নির্বাচিত আইডি দিয়ে সংগ্রহটি পাওয়া যায়নি
de: Sammlung mit der angeforderten ID konnte nicht gefunden werden
es: No se ha podido encontrar la colección con la ID solicitada
fr: La collection avec l'identifiant demandé n'a pas été trouvée
pl: Kolekcja z żądanym ID nie została znaleziona
pt: A coleção com a ID solicitada não foi encontrada
ru: Коллекция с запрошенным идентификатором не найдена
zh: 找不到该 ID 的集合

# document_not_found
source: Document with the requested ID could not be found
ar: لم يتم العثور على مستند بالمعرف المطلوب
bn: নির্বাচিত আইডি দিয়ে দলিলটি পাওয়া যায়নি
de: Dokument mit der angeforderten ID konnte nicht gefunden werden
es: No se ha podido encontrar el documento con la ID solicitada
fr: Le document avec l'identifiant demandé n'a pas été trouvé
pl: Dokument z żądanym ID nie został znaleziony
pt: O documento com a ID solicitada não foi encontrado
ru: Документ с запрошенным идентификатором не найден
zh: 找不到该 ID 的文档

# attribute_not_found
source: Attribute with the requested ID could not be found
ar: لم يتم العثور على سمة بالمعرف المطلوب
bn: নির্বাচিত আইডি দিয়ে বৈশিষ্ট্যটি পাওয়া যায়নি
de: Attribut mit der angeforderten ID konnte nicht gefunden werden
es: No se ha podido encontrar el atributo con la ID solicitada
fr: L'attribut avec l'identifiant demandé n'a pas été trouvé
pl: Atrybut z żądanym ID nie został znaleziony
pt: O atributo com a ID solicitada não foi encontrado
ru: Атрибут с запрошенным идентификатором не найден
zh: 找不到该 ID 的属性

# index_not_found
source: Index with the requested ID could not be found
ar: لم يتم العثور على مؤشر بالمعرف المطلوب
bn: নির্বাচিত আইডি দিয়ে সূচকটি পাওয়া যায়নি
de: Index mit der angeforderten ID konnte nicht gefunden werden
es: No se ha podido encontrar el índice con la ID solicitada
fr: L'index avec l'identifiant demandé n'a pas été trouvé
pl: Indeks z żądanym ID nie został znaleziony
pt: O índice com a ID solicitada não foi encontrado
ru: Индекс с запрошенным идентификатором не найден
zh: 找不到该 ID 的索引

source: Database already exists
ar: قاعدة البيانات موجودة بالفعل
bn: ডেটাবেসটি ইতিমধ্যেই বিদ্যমান
de: Datenbank existiert bereits
es: La base de datos ya existe
fr: La base de données existe déjà
pl: Baza danych już istnieje
pt: Banco de dados já existe
ru: База данных уже существует
zh: 数据库已存在

# collection_already_exists
source: A collection with the requested ID already exists. Try again with a different ID or use unique() to generate a unique ID
ar: مجموعة بالمعرف المطلوب موجودة بالفعل. حاول مرة أخرى باستخدام معرف مختلف أو استخدم unique() لإنشاء معرف فريد
bn: নির্বাচিত আইডি দিয়ে একটি সংগ্রহ ইতিমধ্যেই বিদ্যমান। অনুগ্রহ করে ভিন্ন আইডি দিয়ে চেষ্টা করুন বা একটি অনন্য আইডি তৈরি করতে unique() ব্যবহার করুন
de: Eine Sammlung mit der angeforderten ID existiert bereits. Versuche es mit einer anderen ID oder verwende unique(), um eine eindeutige ID zu generieren
es: Ya existe una colección con la ID solicitada. Inténtelo de nuevo con una ID diferente o utilice unique() para generar una ID única
fr: Une collection avec l'identifiant demandé existe déjà. Réessayez avec un identifiant différent ou utilisez unique() pour générer un identifiant unique
pl: Kolekcja z żądanym ID już istnieje. Spróbuj ponownie z innym ID lub użyj funkcji unique() w celu wygenerowania unikalnego ID
pt: Uma coleção com a ID solicitada já existe. Tente novamente com uma ID diferente ou use unique() para gerar uma ID única
ru: Коллекция с запрошенным идентификатором уже существует. Попробуйте использовать другой идентификатор или unique() для генерации уникального идентификатора
zh: 已存在该 ID 的集合，请使用不同的 ID 重新尝试，或使用 unique() 生成一个唯一 ID

# document_already_exists
source: Document with the requested ID already exists. Try again with a different ID or use unique() to generate a unique ID
ar: مستند بالمعرف المطلوب موجود بالفعل. حاول مرة أخرى باستخدام معرف مختلف أو استخدم unique() لإنشاء معرف فريد
bn: নির্বাচিত আইডি দিয়ে দলিলটি ইতিমধ্যেই বিদ্যমান। অনুগ্রহ করে ভিন্ন আইডি দিয়ে চেষ্টা করুন বা একটি অনন্য আইডি তৈরি করতে unique() ব্যবহার করুন
de: Dokument mit der angeforderten ID existiert bereits. Versuche es mit einer anderen ID oder verwende unique(), um eine eindeutige ID zu generieren
es: Ya existe un documento con la ID solicitada. Inténtelo de nuevo con una ID diferente o utilice unique() para generar una ID única
fr: Le document avec l'identifiant demandé existe déjà. Réessayez avec un identifiant différent ou utilisez unique() pour générer un identifiant unique
pl: Dokument z żądanym ID już istnieje. Spróbuj ponownie z innym ID lub użyj funkcji unique() w celu wygenerowania unikalnego ID
pt: O documento com a ID solicitada já existe. Tente novamente com uma ID diferente ou use unique() para gerar uma ID única
ru: Документ с запрошенным идентификатором уже существует. Попробуйте использовать другой идентификатор или unique() для генерации уникального идентификатора
zh: 已存在该 ID 的文档，请使用不同的 ID 重新尝试，或使用 unique() 生成一个唯一 ID

# document_update_conflict
source: Remote document is newer than local
ar: المستند البعيد أحدث من المستند المحلي
bn: রিমোট দলিলটি স্থানীয় দলিলটির চেয়ে নতুন
de: Entferntes Dokument ist neuer als lokales
es: El documento remoto es más reciente que el local
fr: Le document distant est plus récent que le document local
pl: Zdalny dokument jest nowszy niż lokalny
pt: O documento remoto é mais recente que o local
ru: Удалённый документ новее локального
zh: 远程文档比本地文档更新

# attribute_already_exists
source: Attribute with the requested ID already exists. Try again with a different ID or use unique() to generate a unique ID
ar: سمة بالمعرف المطلوب موجودة بالفعل. حاول مرة أخرى باستخدام معرف مختلف أو استخدم unique() لإنشاء معرف فريد
bn: নির্বাচিত আইডি দিয়ে বৈশিষ্ট্যটি ইতিমধ্যেই বিদ্যমান। অনুগ্রহ করে ভিন্ন আইডি দিয়ে চেষ্টা করুন বা একটি অনন্য আইডি তৈরি করতে unique() ব্যবহার করুন
de: Attribut mit der angeforderten ID existiert bereits. Versuche es mit einer anderen ID oder verwende unique(), um eine eindeutige ID zu generieren
es: Ya existe un atributo con la ID solicitada. Inténtelo de nuevo con una ID diferente o utilice unique() para generar una ID única
fr: L'attribut avec l'identifiant demandé existe déjà. Réessayez avec un identifiant différent ou utilisez unique() pour générer un identifiant unique
pl: Atrybut z żądanym ID już istnieje. Spróbuj ponownie z innym ID lub użyj funkcji unique() w celu wygenerowania unikalnego ID
pt: O atributo com a ID solicitada já existe. Tente novamente com uma ID diferente ou use unique() para gerar uma ID única
ru: Атрибут с запрошенным идентификатором already exists. Попробуйте использовать другой идентификатор или unique() для генерации уникального идентификатора
zh: 已存在该 ID 的属性，请使用不同的 ID 重新尝试，或使用 unique() 生成一个唯一 ID

# index_already_exists
source: Index with the requested ID already exists. Try again with a different ID or use unique() to generate a unique ID
ar: مؤشر بالمعرف المطلوب موجود بالفعل. حاول مرة أخرى باستخدام معرف مختلف أو استخدم unique() لإنشاء معرف فريد
bn: নির্বাচিত আইডি দিয়ে সূচকটি ইতিমধ্যেই বিদ্যমান। অনুগ্রহ করে ভিন্ন আইডি দিয়ে চেষ্টা করুন বা একটি অনন্য আইডি তৈরি করতে unique() ব্যবহার করুন
de: Index mit der angeforderten ID existiert bereits. Versuche es mit einer anderen ID oder verwende unique(), um eine eindeutige ID zu generieren
es: Ya existe un índice con la ID solicitada. Inténtelo de nuevo con una ID diferente o utilice unique() para generar una ID única
fr: L'index avec l'identifiant demandé existe déjà. Réessayez avec un identifiant différent ou utilisez unique() pour générer un identifiant unique
pl: Indeks z żądanym ID już istnieje. Spróbuj ponownie z innym ID lub użyj funkcji unique() w celu wygenerowania unikalnego ID
pt: O índice com a ID solicitada já existe. Tente novamente com uma ID diferente ou use unique() para gerar uma ID única
ru: Индекс с запрошенным идентификатором уже существует. Попробуйте использовать другой идентификатор или unique() для генерации уникального идентификатора
zh: 已存在该 ID 的索引，请使用不同的 ID 重新尝试，或使用 unique() 生成一个唯一 ID

# storage_device_not_found
source: The requested storage device could not be found
ar: لم يتم العثور على جهاز التخزين المطلوب
bn: নির্বাচিত স্টোরেজ ডিভাইসটি পাওয়া যায়নি
de: Das angeforderte Speichergerät konnte nicht gefunden werden
es: No se ha podido encontrar el dispositivo de almacenamiento solicitado
fr: Le périphérique de stockage demandé n'a pas été trouvé
pl: Nie znaleziono żądanego urządzenia pamięci masowej
pt: O dispositivo de armazenamento solicitado não foi encontrado
ru: Запрошенное устройство хранения не найдено
zh: 无法找到该存储设备

# storage_file_empty
source: Empty file passed to the endpoint
ar: تم تمرير ملف فارغ إلى نقطة النهاية
bn: এন্ডপয়েন্টে খালি ফাইল পাঠানো হয়েছে
de: Leere Datei an den Endpunkt übergeben
es: Archivo vacío pasado al punto final
fr: Fichier vide passé au point de terminaison
pl: Pusty plik przesłany do punktu końcowego
pt: Arquivo vazio passado para o endpoint
ru: Передан пустой файл в конечную точку
zh: 传递给端点的文件为空

# storage_file_type_unsupported
source: The given file extension is not supported
ar: امتداد الملف المعطى غير مدعوم
bn: প্রদত্ত ফাইল এক্সটেনশনটি সমর্থিত নয়
de: Die angegebene Dateierweiterung wird nicht unterstützt
es: La extensión de archivo proporcionada no es compatible
fr: L'extension de fichier donnée n'est pas prise en charge
pl: Podane rozszerzenie pliku nie jest obsługiwane
pt: A extensão do arquivo fornecido não é suportada
ru: Указанное расширение файла не поддерживается
zh: 不支持该文件扩展名

# storage_invalid_file_size
source: The file size is either not valid or exceeds the maximum allowed size. Please check the file or the value of the _APP_STORAGE_LIMIT environment variable
ar: حجم الملف إما غير صالح أو يتجاوز الحد الأقصى المسموح به. يرجى التحقق من الملف أو قيمة متغير بيئة _APP_STORAGE_LIMIT
bn: ফাইলের আকারটি অবৈধ বা অনুমোদিত সর্বোচ্চ আকারের চেয়ে বড়। অনুগ্রহ করে ফাইলটি বা _APP_STORAGE_LIMIT পরিবেশ ভেরিয়েবলের মান পরীক্ষা করুন
de: Die Dateigröße ist entweder ungültig oder überschreitet die maximal zulässige Größe. Bitte überprüfe die Datei oder den Wert der Umgebungsvariablen _APP_STORAGE_LIMIT
es: El tamaño del archivo no es válido o excede el tamaño máximo permitido. Por favor, compruebe el archivo o el valor de la variable de entorno _APP_STORAGE_LIMIT
fr: La taille du fichier n'est pas valide ou dépasse la taille maximale autorisée. Veuillez vérifier le fichier ou la valeur de la variable d'environnement _APP_STORAGE_LIMIT
pl: Rozmiar pliku jest nieprawidłowy lub przekracza maksymalny dozwolony rozmiar. Sprawdź plik lub wartość zmiennej środowiskowej _APP_STORAGE_LIMIT
pt: O tamanho do arquivo não é válido ou excede o tamanho máximo permitido. Por favor verifique o arquivo ou o valor da variável de ambiente _APP_STORAGE_LIMIT
ru: Размер файла недействителен или превышает максимально допустимый размер. Пожалуйста, проверьте файл или значение переменной окружения _APP_STORAGE_LIMIT
zh: 文件大小无效或超过最大允许大小，请检查文件或 _APP_STORAGE_LIMIT 环境变量的值
