Repository: LynxLynxx/appwrite_error_handling
Catalog: lib/l10n/intl_*.arb
Languages: ar, bn, de, es, fr, pl, pt, ru, zh

# unknown_error
source: Unknown error occurred
ar: حدث خطأ غير معروف
bn: একটি অজানা ত্রুটি ঘটেছে
de: Ein unbekannter Fehler ist aufgetreten
es: {count, plural, one{Error desconocido} other{Errores desconocidos}}
fr: Une erreur inconnue est survenue
pl: Wystąpił nieznany błąd
pt: Ocorreu um erro desconhecido
ru: Произошла неизвестная ошибка
zh: 未知错误

# general_mock
source: General errors thrown by the mock controller used for testing
ar: أخطاء عامة طرحها وحدة تحكم وهمية مستخدمة للاختبار
bn: टেস্ট করার জন্য মক কন্ট্রোলার দ্বারা সৃষ্ট সাধারণ ত্রুটি
de: Von der Mock-Steuerung für Tests ausgegebene allgemeine Fehler
es: Mensajes de error generales lanzados por el controlador de simulación utilizado para pruebas
fr: Les erreurs générales levées par le contrôleur fictif utilisé pour les tests
pl: Ogólne błędy wygenerowane przez kontroler mocka używanego do testowania
pt: Erros gerais lançados pelo controlador mock usado para testes
ru: Основные ошибки, вызванные контроллером-симулятором, используемым для тестирования
zh: 模拟控制器抛出的通用错误，用于测试

# general_argument_invalid
source: The request contains one or more invalid arguments. Please refer to the endpoint documentation
ar: يحتوي الطلب على وسيطة واحدة أو أكثر غير صالحة. يرجى الرجوع إلى وثائق نقطة النهاية
bn: 요청ে একটি বা একাধিক অবৈধ আর্গুমেন্ট রয়েছে। অনুগ্রহ করে এন্ডপয়েন্ট ডকুমেন্টেশনটি দেখুন
de: Die Anfrage enthält ein oder mehrere ungültige Argumente. Bitte beachten Sie die Dokumentation des Endpunkts
es: La solicitud contiene uno o más argumentos inválidos. Por favor, consulta la documentación del punto final
fr: La requête contient un ou plusieurs arguments invalides. Veuillez consulter la documentation du point de terminaison
pl: Żądanie zawiera jeden lub więcej nieprawidłowych argumentów. Zapoznaj się z dokumentacją punktu końcowego
pt: A solicitação contém um ou mais argumentos inválidos. Por favor, consulte a documentação do ponto final
ru: Запрос содержит один или несколько недопустимых аргументов. Пожалуйста, обратитесь к документации конечной точки
zh: 请求包含一个或多个无效参数。请参阅端点文档

# general_query_limit_exceeded
source: Query limit exceeded for the current attribute. Usage of more than 100 query values on a single attribute is prohibited
ar: تم تجاوز حد الاستعلام للسمة الحالية. يُحظر استخدام أكثر من 100 قيمة استعلام على سمة واحدة
bn: বর্তমান অ্যাট্রিবিউটের জন্য ক্যোয়ারী সীমা অতিক্রম করেছে। একটি একক অ্যাট্রিবিউটে 100টির বেশি ক্যোয়ারী মান ব্যবহার নিষিদ্ধ
de: Das Abfragelimit für das aktuelle Attribut wurde überschritten. Die Verwendung von mehr als 100 Abfragewerten für ein einzelnes Attribut ist nicht zulässig
es: Se excedió el límite de consultas para el atributo actual. Se prohíbe el uso de más de 100 valores de consulta en un solo atributo
fr: Limite de requête dépassée pour l'attribut actuel. L'utilisation de plus de 100 valeurs de requête sur un seul attribut est interdite
pl: Przekroczono limit zapytań dla bieżącego atrybutu. Użycie więcej niż 100 wartości zapytania dla pojedynczego atrybutu jest zabronione
pt: Limite de consultas excedido para o atributo atual. O uso de mais de 100 valores de consulta em um único atributo é proibido
ru: Лимит запросов для текущего атрибута превышен. Использование более 100 значений запросов для одного атрибута запрещено
zh: 当前属性的查询限制已超过。禁止在单个属性上使用超过 100 个查询值

# general_query_invalid
source: The query's syntax is invalid. Please check the query and try again
ar: بنية الاستعلام غير صالحة. يرجى التحقق من الاستعلام وإعادة المحاولة
bn: ক্যোয়ারীর সিনট্যাক্স অবৈধ। অনুগ্রহ করে ক্যোয়ারীটি পরীক্ষা করে পুনরায় চেষ্টা করুন
de: Die Syntax der Abfrage ist ungültig. Bitte überprüfen Sie die Abfrage und versuchen Sie es erneut
es: La sintaxis de la consulta es inválida. Por favor, verifica la consulta e inténtalo de nuevo
fr: La syntaxe de la requête est invalide. Veuillez vérifier la requête et réessayer
pl: Składnia zapytania jest nieprawidłowa. Sprawdź zapytanie i spróbuj ponownie
pt: A sintaxe da consulta é inválida. Por favor, verifique a consulta e tente novamente
ru: Синтаксис запроса недействителен. Пожалуйста, проверьте запрос и повторите попытку
zh: 查询语法无效。请检查查询并重试

# general_cursor_not_found
source: The cursor is invalid. This can happen if the item represented by the cursor has been deleted
ar: المؤشر غير صالح. يمكن أن يحدث هذا إذا تم حذف العنصر الذي يمثله المؤشر
bn: কার্সরটি অবৈধ। এটি তখন হতে পারে যখন কার্সর দ্বারা প্রতিনিধিত্বকারী আইটেমটি মুছে ফেলা হয়েছে
de: Der Cursor ist ungültig. Dies kann passieren, wenn das durch den Cursor dargestellte Element gelöscht wurde
es: El cursor es inválido. Esto puede ocurrir si el elemento representado por el cursor ha sido eliminado.
fr: Le curseur est invalide. Cela peut se produire si l'élément représenté par le curseur a été supprimé
pl: Kursor jest nieprawidłowy. Może się to zdarzyć, jeśli element reprezentowany przez kursor został usunięty
pt: O cursor é inválido. Isso pode acontecer se o item representado pelo cursor foi excluído
ru: Курсор недействителен. Это может произойти, если элемент, представленный курсором, был удален
zh: 游标无效。如果游标表示的项已被删除，则可能发生这种情况

# general_provider_failure
source: VCS (Version Control System) provider failed to process the request. We believe this is an error with the VCS provider. Try again, or contact support for more information
ar: فشلت موفر VCS (نظام التحكم في الإصدارات) في معالجة الطلب. نعتقد أن هذا خطأ مع موفر VCS. حاول مرة أخرى، أو اتصل بالدعم للحصول على مزيد من المعلومات
bn: VCS (ভার্সন কন্ট্রোল সিস্টেম) প্রোভাইডার অনুরোধটি প্রক্রিয়া করতে ব্যর্থ হয়েছে। আমরা বিশ্বাস করি এটি VCS প্রোভাইডারের সাথে একটি সমস্যা। পুনরায় চেষ্টা করুন বা আরও তথ্যের জন্য সহায়তার সাথে যোগাযোগ করুন
de: Der VCS-Anbieter (Version Control System) konnte die Anfrage nicht verarbeiten. Wir gehen davon aus, dass dies ein Fehler des VCS-Anbieters ist. Versuchen Sie es erneut, oder wenden Sie sich für weitere Informationen an den Support
es: El proveedor de VCS (Version Control System) no pudo procesar la solicitud. Creemos que se trata de un error con el proveedor de VCS. Inténtalo de nuevo o ponte en contacto con el equipo de asistencia para obtener más información
fr: Le fournisseur VCS (Version Control System) n'a pas réussi à traiter la demande. Nous pensons qu'il s'agit d'une erreur avec le fournisseur VCS. Réessayez ou contactez le support pour plus d'informations
pl: Dostawca VCS (system kontroli wersji) nie mógł przetworzyć żądania. Uważamy, że jest to błąd dostawcy VCS. Spróbuj ponownie lub skontaktuj się z pomocą techniczną, aby uzyskać więcej informacji
pt: O provedor VCS (Version Control System) falhou ao processar a solicitação. Acreditamos que este é um erro com o provedor VCS. Tente novamente ou contate o suporte para obter mais informações
ru: Поставщик системы контроля версий (VCS) не смог обработать запрос. Мы считаем, что это ошибка поставщика VCS. Попробуйте снова или обратитесь в службу поддержки для получения дополнительной информации
zh: VCS（版本控制系统）提供程序无法处理请求。我们认为这是 VCS 提供程序的错误。请重试，或联系支持人员获取更多信息

# project_unknown
source: The project ID is either missing or not valid. Please check the value of the X-Appwrite-Project header to ensure the correct project ID is being used
ar: معرّف المشروع مفقود أو غير صالح. يرجى التحقق من قيمة رأس X-Appwrite-Project للتأكد من استخدام معرف المشروع الصحيح
bn: প্রকল্পের আইডি অনুপস্থিত বা বৈধ নয়। অনুগ্রহ করে X-Appwrite-Project হেডারের মানটি পরীক্ষা করে নিশ্চিত করুন যে সঠিক প্রকল্পের আইডিটি ব্যবহার করা হচ্ছে
de: Die Projekt-ID fehlt oder ist ungültig. Bitte überprüfen Sie den Wert des Headers X-Appwrite-Project, um sicherzustellen, dass die richtige Projekt-ID verwendet wird
es: El ID del proyecto falta o no es válido. Por favor, verifica el valor de la cabecera X-Appwrite-Project para asegurar que se está utilizando el ID de proyecto correcto
fr: L'ID du projet est soit manquant, soit non valide. Veuillez vérifier la valeur de l'en-tête X-Appwrite-Project pour vous assurer que le bon ID de projet est utilisé
pl: ID projektu jest nieobecne lub nieprawidłowe. Sprawdź wartość nagłówka X-Appwrite-Project, aby upewnić się, że używane jest prawidłowe ID projektu
pt: O ID do projeto está faltando ou não é válido. Por favor, verifique o valor do cabeçalho X-Appwrite-Project para garantir que o ID do projeto correto está sendo usado
ru: Идентификатор проекта отсутствует или недействителен. Пожалуйста, проверьте значение заголовка X-Appwrite-Project, чтобы убедиться, что используется правильный идентификатор проекта
zh: 项目 ID 缺失或无效。请检查 X-Appwrite-Project 标头的值，以确保使用正确的项目 ID

# project_invalid_success_url
source: Invalid redirect URL for OAuth success
ar: عنوان URL لإعادة توجيه غير صالح لنجاح OAuth
bn: OAuth সাফল্যের জন্য অবৈধ রিডাইরেক্ট URL
de: Ungültige Umleitungs-URL für OAuth-Erfolg
es: URL de redirección no válida para el éxito de OAuth
fr: URL de redirection invalide pour la réussite de l'OAuth
pl: Nieprawidłowy adres URL przekierowania dla sukcesu OAuth
pt: URL de redirecionamento inválida para o sucesso do OAuth
ru: Недопустимый URL-адрес перенаправления для успешного выполнения OAuth
zh: OAuth 成功重定向 URL 无效

# project_invalid_failure_url
source: Invalid redirect URL for OAuth failure
ar: عنوان URL لإعادة توجيه غير صالح لفشل OAuth
bn: OAuth ব্যর্থতার জন্য অবৈধ রিডাইরেক্ট URL
de: Ungültige Umleitungs-URL für OAuth-Fehler
es: URL de redirección no válida para el error de OAuth
fr: URL de redirection invalide pour l'échec de l'OAuth
pl: Nieprawidłowy adres URL przekierowania dla błędu OAuth
pt: URL de redirecionamento inválida para a falha do OAuth
ru: Недопустимый URL-адрес перенаправления для сбоя OAuth
zh: OAuth 失败重定向 URL 无效

# project_reserved_project
source: The project ID is reserved. Please choose another project ID
ar: معرّف المشروع محجوز. يرجى اختيار معرف مشروع آخر
bn: প্রকল্পের আইডিটি সংরক্ষিত। অনুগ্রহ করে অন্য একটি প্রকল্পের আইডি চয়ন করুন
de: Die Projekt-ID ist reserviert. Bitte wählen Sie eine andere Projekt-ID
es: El ID del proyecto está reservado. Por favor, elige otro ID de proyecto
fr: L'ID du projet est réservé. Veuillez choisir un autre ID de projet
pl: ID projektu jest zarezerwowane. Wybierz inne ID projektu
pt: O ID do projeto está reservado. Por favor, escolha outro ID de projeto
ru: Идентификатор проекта зарезервирован. Пожалуйста, выберите другой идентификатор проекта
zh: 项目 ID 已保留。请选择另一个项目 ID

# project_smtp_config_invalid
source: Provided SMTP config is invalid. Please check the configured values and try again
ar: تكوين SMTP المقدم غير صالح. يرجى التحقق من القيم المكونة وإعادة المحاولة
bn: প্রদত্ত SMTP কনফিগারেশনটি অবৈধ। অনুগ্রহ করে কনফিগার করা মানগুলি পরীক্ষা করে পুনরায় চেষ্টা করুন
de: Die angegebene SMTP-Konfiguration ist ungültig. Bitte überprüfen Sie die konfigurierten Werte und versuchen Sie es erneut
es: La configuración SMTP proporcionada es inválida. Por favor, revisa los valores configurados e inténtalo de nuevo
fr: La configuration SMTP fournie est invalide. Veuillez vérifier les valeurs configurées et réessayer
pl: Podana konfiguracja SMTP jest nieprawidłowa. Sprawdź skonfigurowane wartości i spróbuj ponownie
pt: Configuração SMTP fornecida é inválida. Por favor, verifique os valores configurados e tente novamente
ru: Предоставленная конфигурация SMTP недействительна. Пожалуйста, проверьте сконфигурированные значения и повторите попытку
zh: 提供的 SMTP 配置无效。请检查配置的值并重试

# project_key_expired
source: The project key has expired. Please generate a new key using the Appwrite console
ar: انتهت صلاحية مفتاح المشروع. يرجى إنشاء مفتاح جديد باستخدام لوحة تحكم Appwrite
bn: প্রকল্পের কীটি মেয়াদ উত্তীর্ণ হয়েছে। অনুগ্রহ করে Appwrite কনসোল ব্যবহার করে একটি নতুন কী তৈরি করুন
de: Der Projektschlüssel ist abgelaufen. Bitte generieren Sie einen neuen Schlüssel über die Appwrite-Konsole
es: La clave del proyecto ha expirado. Por favor, genera una nueva clave utilizando la consola de Appwrite
fr: La clé du projet a expiré. Veuillez générer une nouvelle clé en utilisant la console Appwrite
pl: Klucz projektu wygasł. Wygeneruj nowy klucz za pomocą konsoli Appwrite
pt: A chave do projeto expirou. Por favor, gere uma nova chave usando o console Appwrite
ru: Срок действия ключа проекта истек. Пожалуйста, сгенерируйте новый ключ с помощью консоли Appwrite
zh: 项目密钥已过期。请使用 Appwrite 控制台生成新密钥

# rule_verification_failed
source: Domain verification failed. Please check if your DNS records are correct and try again
ar: فشلت عملية التحقق من النطاق. يرجى التحقق مما إذا كانت سجلات DNS صحيحة وإعادة المحاولة
bn: ডোমেইন যাচাই ব্যর্থ হয়েছে। অনুগ্রহ করে পরীক্ষা করে দেখুন আপনার DNS রেকর্ডগুলি সঠিক কিনা এবং পুনরায় চেষ্টা করুন
de: Die Domain-Verifizierung ist fehlgeschlagen. Bitte überprüfen Sie, ob Ihre DNS-Einträge korrekt sind, und versuchen Sie es erneut
es: La verificación del dominio falló. Por favor, verifica si tus registros DNS son correctos e inténtalo de nuevo
fr: La vérification du domaine a échoué. Veuillez vérifier si vos enregistrements DNS sont corrects et réessayer
pl: Weryfikacja domeny nie powiodła się. Sprawdź, czy Twoje wpisy DNS są poprawne i spróbuj ponownie
pt: Verificação de domínio falhou. Por favor, verifique se seus registros DNS estão corretos e tente novamente
ru: Проверка домена не удалась. Пожалуйста, проверьте, правильно ли настроены ваши записи DNS, и повторите попытку
zh: 域名验证失败。请检查您的 DNS 记录是否正确，并重试

# project_template_default_deletion
source: You can't delete default template. If you are trying to reset your template changes, you can ignore this error as it's already been reset
ar: لا يمكنك حذف القالب الافتراضي. إذا كنت تحاول إعادة تعيين تغييرات القالب، فيمكنك تجاهل هذا الخطأ لأنه قد تم إعادة تعيينه بالفعل
bn: আপনি ডিফল্ট টেমপ্লেট মুছতে পারবেন না। যদি আপনি আপনার টেমপ্লেট পরিবর্তনগুলি পুনরায় সেট করার চেষ্টা করছেন, তাহলে আপনি এই ত্রুটিকে উপেক্ষা করতে পারেন কারণ এটি ইতিমধ্যেই পুনরায় সেট করা হয়েছে
de: Sie können die Standardvorlage nicht löschen. Wenn Sie versuchen, Ihre Vorlagenänderungen zurückzusetzen, können Sie diesen Fehler ignorieren, da er bereits zurückgesetzt wurde
es: No puedes eliminar la plantilla por defecto. Si estás intentando restablecer los cambios de tu plantilla, puedes ignorar este error ya que ya ha sido restablecida
fr: Vous ne pouvez pas supprimer le modèle par défaut. Si vous essayez de réinitialiser les modifications de votre modèle, vous pouvez ignorer cette erreur car elle a déjà été réinitialisée
pl: Nie możesz usunąć domyślnego szablonu. Jeśli próbujesz zresetować zmiany w szablonie, możesz zignorować ten błąd, ponieważ został już zresetowany
pt: Você não pode excluir o modelo padrão. Se você está tentando redefinir suas alterações de modelo, você pode ignorar este erro, pois ele já foi redefinido
ru: Вы не можете удалить шаблон по умолчанию. Если вы пытаетесь сбросить изменения шаблона, вы можете игнорировать эту ошибку, так как она уже сброшена
zh: 您无法删除默认模板。如果您尝试重置模板更改，您可以忽略此错误，因为它已经重置

# general_unknown_origin
source: The request originated from an unknown origin. If you trust this domain, please list it as a trusted platform in the Appwrite console
ar: نشأ الطلب من أصل غير معروف. إذا كنت تثق في هذا المجال، فيرجى إدراجه كمنصة موثوقة في لوحة تحكم Appwrite
bn: অনুরোধটি একটি অজানা উৎস থেকে এসেছে। যদি আপনি এই ডোমেইনটিতে বিশ্বাস করেন, তাহলে অনুগ্রহ করে এটিকে Appwrite কনসোলে একটি বিশ্বস্ত প্ল্যাটফর্ম হিসাবে তালিকাভুক্ত করুন
de: Die Anfrage stammt aus einer unbekannten Quelle. Wenn Sie dieser Domain vertrauen, listen Sie sie bitte als vertrauenswürdige Plattform in der Appwrite-Konsole auf
es: La solicitud se originó desde un origen desconocido. Si confías en este dominio, por favor, añádelo como una plataforma confiable en la consola de Appwrite
fr: La requête provient d'une origine inconnue. Si vous faites confiance à ce domaine, veuillez l'inscrire comme une plateforme de confiance dans la console Appwrite
pl: Żądanie pochodzi z nieznanego źródła. Jeśli ufasz tej domenie, umieść ją na liście zaufanych platform w konsoli Appwrite
pt: A solicitação originou-se de uma origem desconhecida. Se você confia neste domínio, por favor, liste-o como uma plataforma confiável no console Appwrite
ru: Запрос поступил из неизвестного источника. Если вы доверяете этому домену, пожалуйста, добавьте его в список доверенных платформ в консоли Appwrite
zh: 请求来自未知来源。如果您信任此域，请在 Appwrite 控制台中将其列为受信任平台

# general_access_forbidden
source: Access to this API is forbidden
ar: ممنوع الوصول إلى هذه الواجهة. راجع وثائق OAuth
bn: এই API তে অ্যাক্সেস নিষিদ্ধ
de: Der Zugriff auf diese API ist verboten
es: El acceso a esta API está prohibido
fr: L'accès à cette API est interdit
pl: Dostęp do tego API jest zabroniony
pt: O acesso a esta API é proibido
ru: Доступ к этому API запрещен
zh: 禁止访问此 API

# general_unauthorized_scope
source: The current user or API key does not have the required scopes to access the requested resource
ar: لا يمتلك مستخدم API الحالي أو مفتاح API النطاقات المطلوبة للوصول إلى المورد المطلوب
bn: বর্তমান ব্যবহারকারী বা API কীটির অনুরোধ করা সম্পদের অ্যাক্সেস করার জন্য প্রয়োজনীয় স্কোপ নেই
de: Der aktuelle Benutzer oder API-Schlüssel verfügt nicht über die erforderlichen Berechtigungen, um auf die angeforderte Ressource zuzugreifen
es: El usuario actual o la clave de API no tienen los alcances necesarios para acceder al recurso solicitado
fr: L'utilisateur actuel ou la clé API n'a pas les droits nécessaires pour accéder à la ressource demandée
pl: Bieżący użytkownik lub klucz API nie ma wymaganych zakresów dostępu do żądanego zasobu
pt: O usuário atual ou a chave de API não tem os escopos necessários para acessar o recurso solicitado
ru: У текущего пользователя или ключа API нет необходимых разрешений для доступа к запрошенному ресурсу
zh: 当前用户或 API 密钥没有访问请求资源所需的范围

# general_route_not_found
source: The requested route was not found. Please refer to the API docs and try again
ar: لم يتم العثور على الطريق المطلوب. يرجى الرجوع إلى وثائق API وإعادة المحاولة
bn: অনুরোধ করা রুটটি পাওয়া যায়নি। অনুগ্রহ করে API ডক্সগুলি দেখুন এবং পুনরায় চেষ্টা করুন
de: Die angeforderte Route wurde nicht gefunden. Bitte beachten Sie die API-Dokumentation und versuchen Sie es erneut
es: La ruta solicitada no fue encontrada. Por favor, consulta los documentos de la API e inténtalo de nuevo
fr: La route demandée n'a pas été trouvée. Veuillez vous référer à la documentation de l'API et réessayer
pl: Nie znaleziono żądanej trasy. Zapoznaj się z dokumentacją API i spróbuj ponownie
pt: A rota solicitada não foi encontrada. Por favor, consulte os documentos da API e tente novamente
ru: Запрошенный маршрут не найден. Пожалуйста, обратитесь к документации API и повторите попытку
zh: 请求的路由未找到。请参阅 API 文档并重试

# webhook_not_found
source: Webhook with the requested ID could not be found
ar: لم يتم العثور على Webhook باستخدام المعرف المطلوب
bn: অনুরোধ করা আইডি সহ ওয়েবহুক পাওয়া যায়নি
de: Webhook mit der angeforderten ID konnte nicht gefunden werden
es: No se pudo encontrar el webhook con el ID solicitado
fr: Le webhook avec l'ID demandé n'a pas été trouvé
pl: Nie można znaleźć webhooku o żądanym ID
pt: Webhook com o ID solicitado não foi encontrado
ru: Webhook с запрошенным ID не найден
zh: 找不到具有请求 ID 的 Webhook

# rule_resource_not_found
source: Resource could not be found. Please check if the resourceId and resourceType are correct, or if the resource actually exists
ar: لم يتم العثور على المورد. يرجى التحقق مما إذا كان resourceId و resourceType صحيحين، أو إذا كان المورد موجودًا بالفعل
bn: সম্পদ পাওয়া যায়নি। অনুগ্রহ করে পরীক্ষা করে দেখুন resourceId এবং resourceType সঠিক কিনা, অথবা সম্পদটি আসলেই বিদ্যমান কিনা
de: Ressource konnte nicht gefunden werden. Bitte überprüfen Sie, ob die resourceId und der resourceType korrekt sind oder ob die Ressource tatsächlich existiert
es: No se pudo encontrar el recurso. Por favor, verifica si el resourceId y el resourceType son correctos, o si el recurso realmente existe
fr: La ressource n'a pas été trouvée. Veuillez vérifier si le resourceId et le resourceType sont corrects, ou si la ressource existe réellement
pl: Nie można znaleźć zasobu. Sprawdź, czy resourceId i resourceType są poprawne lub czy zasób rzeczywiście istnieje
pt: Recurso não foi encontrado. Por favor, verifique se o resourceId e resourceType estão corretos ou se o recurso realmente existe
ru: Ресурс не найден. Пожалуйста, проверьте, правильны ли resourceId и resourceType, или действительно ли ресурс существует
zh: 找不到资源。请检查 resourceId 和 resourceType 是否正确，或者资源是否实际存在

# rule_not_found
source: Rule with the requested ID could not be found. Please check if the ID provided is correct or if the rule actually exists
ar: لم يتم العثور على قاعدة باستخدام المعرف المطلوب. يرجى التحقق مما إذا كان المعرف المقدم صحيحًا أو إذا كانت القاعدة موجودة بالفعل
bn: অনুরোধ করা আইডি সহ নিয়ম পাওয়া যায়নি। অনুগ্রহ করে পরীক্ষা করে দেখুন প্রদত্ত আইডিটি সঠিক কিনা অথবা নিয়মটি আসলেই বিদ্যমান কিনা
de: Regel mit der angeforderten ID konnte nicht gefunden werden. Bitte überprüfen Sie, ob die angegebene ID korrekt ist oder ob die Regel tatsächlich existiert
es: No se pudo encontrar la regla con el ID solicitado. Por favor, verifica si el ID proporcionado es correcto o si la regla realmente existe
fr: La règle avec l'ID demandé n'a pas été trouvée. Veuillez vérifier si l'ID fourni est correct ou si la règle existe réellement
pl: Nie można znaleźć reguły o żądanym ID. Sprawdź, czy podane ID jest poprawne lub czy reguła rzeczywiście istnieje
pt: Regra com o ID solicitado não foi encontrada. Por favor, verifique se o ID fornecido está correto ou se a regra realmente existe
ru: Правило с запрошенным ID не найдено. Пожалуйста, проверьте, правильный ли ID предоставлен или действительно ли правило существует
zh: 找不到具有请求 ID 的规则。请检查提供的 ID 是否正确，或者规则是否实际存在

# key_not_found
source: Key with the requested ID could not be found
ar: لم يتم العثور على المفتاح باستخدام المعرف المطلوب
bn: অনুরোধ করা আইডি সহ কীটি পাওয়া যায়নি
de: Schlüssel mit der angeforderten ID konnte nicht gefunden werden
es: No se pudo encontrar la clave con el ID solicitado
fr: La clé avec l'ID demandé n'a pas été trouvée
pl: Nie można znaleźć klucza o żądanym ID
pt: Chave com o ID solicitado não foi encontrada
ru: Ключ с запрошенным ID не найден
zh: 找不到具有请求 ID 的密钥

# platform_not_found
source: Platform with the requested ID could not be found
ar: لم يتم العثور على منصة باستخدام المعرف المطلوب
bn: অনুরোধ করা আইডি সহ প্ল্যাটফর্ম পাওয়া যায়নি
de: Plattform mit der angeforderten ID konnte nicht gefunden werden
es: No se pudo encontrar la plataforma con el ID solicitado
fr: La plateforme avec l'ID demandé n'a pas été trouvée
pl: Nie można znaleźć platformy o żądanym ID
pt: Plataforma com o ID solicitado não foi encontrada
ru: Платформа с запрошенным ID не найдена
zh: 找不到具有请求 ID 的平台
