Repository: LynxLynxx/appwrite_error_handling
Catalog: lib/l10n/intl_*.arb
Languages: ar, bn, de, es, fr, pl, pt, ru, zh

# project_not_found
source: Project with the requested ID could not be found. Please check the value of the X-Appwrite-Project header to ensure the correct project ID is being used
ar: لم يتم العثور على مشروع باستخدام المعرف المطلوب. يرجى التحقق من قيمة رأس X-Appwrite-Project للتأكد من استخدام معرف المشروع الصحيح
bn: অনুরোধ করা আইডি সহ প্রকল্প পাওয়া যায়নি। অনুগ্রহ করে X-Appwrite-Project হেডারের মানটি পরীক্ষা করে নিশ্চিত করুন যে সঠিক প্রকল্পের আইডিটি ব্যবহার করা হচ্ছে
de: Projekt mit der angeforderten ID konnte nicht gefunden werden. Bitte überprüfen Sie den Wert des Headers X-Appwrite-Project, um sicherzustellen, dass die richtige Projekt-ID verwendet wird
es: No se pudo encontrar el proyecto con el ID solicitado. Por favor, verifica el valor de la cabecera X-Appwrite-Project para asegurar que se está utilizando el ID de proyecto correcto
fr: Le projet avec l'ID demandé n'a pas été trouvé. Veuillez vérifier la valeur de l'en-tête X-Appwrite-Project pour vous assurer que le bon ID de projet est utilisé
pl: Nie można znaleźć projektu o żądanym ID. Sprawdź wartość nagłówka X-Appwrite-Project, aby upewnić się, że używane jest prawidłowe ID projektu
pt: Projeto com o ID solicitado não foi encontrado. Por favor, verifique o valor do cabeçalho X-Appwrite-Project para garantir que o ID do projeto correto está sendo usado
ru: Проект с запрошенным ID не найден. Пожалуйста, проверьте значение заголовка X-Appwrite-Project, чтобы убедиться, что используется правильный идентификатор проекта
zh: 找不到具有请求 ID 的项目。请检查 X-Appwrite-Project 标头的值，以确保使用正确的项目 ID

# router_host_not_found
source: Host is not trusted. This could occur because you have not configured a custom domain. Add a custom domain to your project first and try again
ar: المضيف غير موثوق به. قد يحدث هذا لأنك لم تقم بتكوين مجال مخصص. أضف مجالًا مخصصًا إلى مشروعك أولاً، ثم حاول مرة أخرى
bn: হোস্টটি বিশ্বস্ত নয়। এটি এমন কারণে হতে পারে যে আপনি একটি কাস্টম ডোমেইন কনফিগার করেননি। প্রথমে আপনার প্রকল্পে একটি কাস্টম ডোমেইন যুক্ত করুন এবং পুনরায় চেষ্টা করুন
de: Host ist nicht vertrauenswürdig. Dies kann daran liegen, dass Sie keine benutzerdefinierte Domain konfiguriert haben. Fügen Sie Ihrem Projekt zunächst eine benutzerdefinierte Domain hinzu und versuchen Sie es erneut
es: El host no es confiable. Esto podría ocurrir porque no has configurado un dominio personalizado. Añade primero un dominio personalizado a tu proyecto e inténtalo de nuevo
fr: L'hôte n'est pas de confiance. Cela peut se produire parce que vous n'avez pas configuré de domaine personnalisé. Ajoutez d'abord un domaine personnalisé à votre projet et réessayez
pl: Host nie jest zaufany. Może się tak dziać, ponieważ nie skonfigurowałeś domeny niestandardowej. Najpierw dodaj niestandardową domenę do projektu i spróbuj ponownie
pt: O host não é confiável. Isso pode ocorrer porque você não configurou um domínio personalizado. Adicione um domínio personalizado ao seu projeto primeiro e tente novamente
ru: Хост не является доверенным. Это может произойти, если вы не настроили собственный домен. Сначала добавьте в свой проект собственный домен и повторите попытку
zh: 主机不受信任。这可能是因为您尚未配置自定义域名。请先将自定义域名添加到您的项目，然后重试

# general_not_implemented
source: This method was not fully implemented yet. If you believe this is a mistake, please upgrade your Appwrite server version
ar: لم يتم تنفيذ هذه الطريقة بالكامل بعد. إذا كنت تعتقد أن هذا خطأ، فيرجى ترقية إصدار خادم Appwrite الخاص بك
bn: এই পদ্ধতিটি এখনও সম্পূর্ণরূপে বাস্তবায়িত হয়নি। যদি আপনি বিশ্বাস করেন যে এটি একটি ভুল, তাহলে অনুগ্রহ করে আপনার Appwrite সার্ভার সংস্করণটি আপগ্রেড করুন
de: Diese Methode wurde noch nicht vollständig implementiert. Wenn Sie glauben, dass dies ein Fehler ist, aktualisieren Sie bitte Ihre Appwrite-Serverversion
es: Este método aún no se ha implementado completamente. Si crees que esto es un error, por favor, actualiza la versión del servidor de Appwrite
fr: Cette méthode n'a pas encore été entièrement implémentée. Si vous pensez qu'il s'agit d'une erreur, veuillez mettre à jour la version de votre serveur Appwrite
pl: Ta metoda nie została jeszcze w pełni zaimplementowana. Jeśli uważasz, że jest to błąd, zaktualizuj wersję serwera Appwrite
pt: Este método ainda não foi totalmente implementado. Se você acredita que isso é um erro, por favor, atualize a versão do seu servidor Appwrite
ru: Этот метод еще не полностью реализован. Если вы считаете, что это ошибка, пожалуйста, обновите версию вашего сервера Appwrite
zh: 此方法尚未完全实现。如果您认为这是一个错误，请升级您的 Appwrite 服务器版本

# project_already_exists
source: Project with the requested ID already exists. Try again with a different ID or use unique() to generate a unique ID
ar: المشروع الذي يحتوي على المعرف المطلوب موجود بالفعل. حاول مرة أخرى باستخدام معرف مختلف أو استخدم unique() لإنشاء معرف فريد
bn: অনুরোধ করা আইডি সহ প্রকল্পটি ইতিমধ্যেই বিদ্যমান। অনুগ্রহ করে অন্য একটি আইডি দিয়ে পুনরায় চেষ্টা করুন অথবা একটি অনন্য আইডি তৈরি করতে unique() ব্যবহার করুন
de: Projekt mit der angeforderten ID existiert bereits. Versuchen Sie es mit einer anderen ID oder verwenden Sie unique(), um eine eindeutige ID zu generieren
es: El proyecto con el ID solicitado ya existe. Inténtalo de nuevo con un ID diferente o utiliza unique() para generar un ID único
fr: Un projet avec l'ID demandé existe déjà. Réessayez avec un autre ID ou utilisez unique() pour générer un ID unique
pl: Projekt o żądanym ID już istnieje. Spróbuj ponownie z innym ID lub użyj unique(), aby wygenerować unikalne ID
pt: Projeto com o ID solicitado já existe. Tente novamente com um ID diferente ou use unique() para gerar um ID exclusivo
ru: Проект с запрошенным ID уже существует. Попробуйте снова с другим ID или используйте unique() для генерации уникального ID
zh: 具有请求 ID 的项目已存在。请尝试使用不同的 ID 或使用 unique() 生成唯一 ID

# rule_already_exists
source: Domain is already used. Please try again with a different domain
ar: يتم استخدام النطاق بالفعل. يرجى المحاولة مرة أخرى باستخدام مجال مختلف
bn: ডোমেইনটি ইতিমধ্যেই ব্যবহার করা হচ্ছে। অনুগ্রহ করে অন্য একটি ডোমেইন দিয়ে পুনরায় চেষ্টা করুন
de: Domain wird bereits verwendet. Bitte versuchen Sie es erneut mit einer anderen Domain
es: El dominio ya está siendo usado. Por favor, inténtalo de nuevo con un dominio diferente
fr: Le domaine est déjà utilisé. Veuillez réessayer avec un domaine différent
pl: Domena jest już używana. Spróbuj ponownie z inną domeną
pt: Domínio já está sendo usado. Por favor, tente novamente com um domínio diferente
ru: Домен уже используется. Пожалуйста, попробуйте снова с другим доменом
zh: 域已被使用。请尝试使用不同的域

# project_provider_disabled
source: The chosen OAuth provider is disabled. You can enable the OAuth provider using the Appwrite console
ar: تم تعطيل موفر OAuth المحدد. يمكنك تمكين موفر OAuth باستخدام لوحة تحكم Appwrite
bn: নির্বাচিত OAuth প্রোভাইডারটি অক্ষম করা আছে। আপনি Appwrite কনসোল ব্যবহার করে OAuth প্রোভাইডারটিকে সক্ষম করতে পারেন
de: Der gewählte OAuth-Anbieter ist deaktiviert. Sie können den OAuth-Anbieter über die Appwrite-Konsole aktivieren
es: El proveedor OAuth elegido está deshabilitado. Puedes habilitar el proveedor OAuth utilizando la consola de Appwrite
fr: Le fournisseur OAuth choisi est désactivé. Vous pouvez activer le fournisseur OAuth en utilisant la console Appwrite
pl: Wybrany dostawca OAuth jest wyłączony. Możesz włączyć dostawcę OAuth za pomocą konsoli Appwrite
pt: O provedor OAuth escolhido está desativado. Você pode ativar o provedor OAuth usando o console Appwrite
ru: Выбранный OAuth-провайдер отключен. Вы можете включить OAuth-провайдер с помощью консоли Appwrite
zh: 所选 OAuth 提供程序已禁用。您可以使用 Appwrite 控制台启用 OAuth 提供程序

# general_rate_limit_exceeded
source: Rate limit for the current endpoint has been exceeded. Please try again after some time
ar: تم تجاوز حد المعدل لنقطة النهاية الحالية. يرجى المحاولة مرة أخرى بعد بعض الوقت
bn: বর্তমান এন্ডপয়েন্টের জন্য রেট সীমা অতিক্রম করেছে। অনুগ্রহ করে কিছুক্ষণ পরে পুনরায় চেষ্টা করুন
de: Das Ratenlimit für den aktuellen Endpunkt wurde überschritten. Bitte versuchen Sie es nach einiger Zeit erneut
es: Se ha excedido el límite de velocidad para el punto final actual. Por favor, inténtalo de nuevo después de un tiempo
fr: La limite de taux pour le point de terminaison actuel a été dépassée. Veuillez réessayer après un certain temps
pl: Przekroczono limit szybkości dla bieżącego punktu końcowego. Spróbuj ponownie po pewnym czasie
pt: O limite de frequência para o ponto final atual foi excedido. Por favor, tente novamente após algum tempo
ru: Превышен лимит запросов для текущей конечной точки. Пожалуйста, попробуйте снова через некоторое время
zh: 当前端点的速率限制已超过。请过一段时间后重试

# general_unknown
source: An unknown error has occurred. Please check the logs for more information
ar: حدث خطأ غير معروف. يرجى التحقق من السجلات للحصول على مزيد من المعلومات
bn: একটি অজানা ত্রুটি ঘটেছে। অনুগ্রহ করে আরও তথ্যের জন্য লগগুলি পরীক্ষা করুন
de: Ein unbekannter Fehler ist aufgetreten. Bitte überprüfen Sie die Protokolle für weitere Informationen
es: Ha ocurrido un error desconocido. Por favor, revisa los registros para obtener más información
fr: Une erreur inconnue s'est produite. Veuillez consulter les journaux pour plus d'informations
pl: Wystąpił nieznany błąd. Sprawdź dzienniki, aby uzyskać więcej informacji
pt: Ocorreu um erro desconhecido. Por favor, verifique os logs para mais informações
ru: Произошла неизвестная ошибка. Пожалуйста, проверьте логи для получения дополнительной информации
zh: 发生未知错误。请检查日志以获取更多信息

# general_server_error
source: An internal server error occurred
ar: حدث خطأ داخلي في الخادم
bn: একটি অভ্যন্তরীণ সার্ভার ত্রুটি ঘটেছে
de: Ein interner Serverfehler ist aufgetreten
es: Ha ocurrido un error interno en el servidor
fr: Une erreur interne du serveur s'est produite
pl: Wystąpił wewnętrzny błąd serwera
pt: Ocorreu um erro interno no servidor
ru: Произошла внутренняя ошибка сервера
zh: 发生内部服务器错误

# general_protocol_unsupported
source: The request cannot be fulfilled with the current protocol. Please check the value of the _APP_OPTIONS_FORCE_HTTPS environment variable
ar: لا يمكن تلبيت الطلب بالبروتوكول الحالي. يرجى التحقق من قيمة متغير بيئة _APP_OPTIONS_FORCE_HTTPS
bn: বর্তমান প্রোটোকল দিয়ে অনুরোধটি পূরণ করা যাবে না। অনুগ্রহ করে _APP_OPTIONS_FORCE_HTTPS পরিবেশ ভেরিয়েবলের মানটি পরীক্ষা করুন
de: Die Anfrage kann mit dem aktuellen Protokoll nicht erfüllt werden. Bitte überprüfen Sie den Wert der Umgebungsvariablen _APP_OPTIONS_FORCE_HTTPS
es: La solicitud no se puede completar con el protocolo actual. Por favor, verifica el valor de la variable de entorno _APP_OPTIONS_FORCE_HTTPS
fr: La requête ne peut pas être satisfaite avec le protocole actuel. Veuillez vérifier la valeur de la variable d'environnement _APP_OPTIONS_FORCE_HTTPS
pl: Żądania nie można zrealizować przy użyciu bieżącego protokołu. Sprawdź wartość zmiennej środowiskowej _APP_OPTIONS_FORCE_HTTPS
pt: A solicitação não pode ser atendida com o protocolo atual. Por favor, verifique o valor da variável de ambiente _APP_OPTIONS_FORCE_HTTPS
ru: Запрос не может быть выполнен с помощью текущего протокола. Пожалуйста, проверьте значение переменной окружения _APP_OPTIONS_FORCE_HTTPS
zh: 无法使用当前协议完成请求。请检查 _APP_OPTIONS_FORCE_HTTPS 环境变量的值

# general_codes_disabled
source: Invitation codes are disabled on this server. Please contact the server administrator
ar: رموز الدعوة معطلة على هذا الخادم. يرجى الاتصال بمسؤول الخادم
bn: এই সার্ভারে আমন্ত্রণ কোডগুলি অক্ষম করা আছে। অনুগ্রহ করে সার্ভার অ্যাডমিনিস্ট্রেটরের সাথে যোগাযোগ করুন
de: Einladungscodes sind auf diesem Server deaktiviert. Bitte wenden Sie sich an den Serveradministrator
es: Los códigos de invitación están deshabilitados en este servidor. Por favor, contacta con el administrador del servidor
fr: Les codes d'invitation sont désactivés sur ce serveur. Veuillez contacter l'administrateur du serveur
pl: Kody zaproszeń są wyłączone na tym serwerze. Skontaktuj się z administratorem serwera
pt: Os códigos de convite estão desabilitados neste servidor. Por favor, contate o administrador do servidor
ru: Коды приглашения отключены на этом сервере. Пожалуйста, свяжитесь с администратором сервера
zh: 此服务器上的邀请码已禁用。请联系服务器管理员

# router_domain_not_configured
source: _APP_DOMAIN, _APP_DOMAIN_TARGET, and _APP_DOMAIN_FUNCTIONS environment variables have not been configured. Please configure the domain environment variables before accessing the Appwrite Console via any IP address or hostname other than localhost. This value could be an IP like 203.0.113.0 or a hostname like example.com
bn: _APP_DOMAIN, _APP_DOMAIN_TARGET, এবং _APP_DOMAIN_FUNCTIONS পরিবেশ ভেরিয়েবলগুলি কনফিগার করা হয়নি। আপনার অ্যাপরাইট কনসোলকে লোকালহোস্ট ব্যতীত অন্য কোনও আইপি ঠিকানা বা হোস্টনামের মাধ্যমে অ্যাক্সেস করার আগে দয়া করে ডোমেন পরিবেশ ভেরিয়েবলগুলি কনফিগার করুন। এই মানটি 203.0.113.0 এর মতো একটি আইপি বা example.com এর মতো একটি হোস্টনাম হতে পারে।
de: _APP_DOMAIN, _APP_DOMAIN_TARGET und _APP_DOMAIN_FUNCTIONS Umgebungsvariablen wurden nicht konfiguriert. Bitte konfigurieren Sie die Domain-Umgebungsvariablen, bevor Sie auf die Appwrite-Konsole über eine andere IP-Adresse oder einen anderen Hostnamen als localhost zugreifen. Dies könnte eine IP wie 203.0.113.0 oder ein Hostname wie example.com sein.
es: _APP_DOMAIN, _APP_DOMAIN_TARGET y _APP_DOMAIN_FUNCTIONS no han sido configuradas. Por favor, configura las variables de entorno del dominio antes de acceder a la Consola Appwrite a través de cualquier dirección IP o nombre de host distinto a localhost. Este valor podría ser una IP como 203.0.113.0 o un nombre de host como example.com
fr: Les variables d'environnement _APP_DOMAIN, _APP_DOMAIN_TARGET et _APP_DOMAIN_FUNCTIONS n'ont pas été configurées. Veuillez configurer les variables d'environnement du domaine avant d'accéder à la console Appwrite via une adresse IP ou un nom d'hôte autre que localhost. Cette valeur peut être une IP comme 203.0.113.0 ou un nom d'hôte comme example.com.
pl: _APP_DOMAIN, _APP_DOMAIN_TARGET i _APP_DOMAIN_FUNCTIONS zmienne środowiskowe nie zostały skonfigurowane. Skonfiguruj zmienne środowiskowe domeny przed uzyskaniem dostępu do Konsoli Appwrite za pośrednictwem dowolnego adresu IP lub nazwy hosta innej niż localhost. Wartość ta może być adresem IP, takim jak 203.0.113.0 lub nazwą hosta, taką jak przykład.com
pt: _APP_DOMAIN, _APP_DOMAIN_TARGET e _APP_DOMAIN_FUNCTIONS as variáveis de ambiente não foram configuradas. Por favor, configure as variáveis de ambiente de domínio antes de acessar o Appwrite Console através de qualquer endereço IP ou nome de host diferente do localhost. Este valor pode ser um IP como 203.0.113.0 ou um nome de host como example.com
ru: _APP_DOMAIN, _APP_DOMAIN_TARGET, и _APP_DOMAIN_FUNCTIONS переменные среды не настроены. Пожалуйста, настройте переменные среды домена перед доступом к консоли Appwrite через любой IP-адрес или имя хоста, кроме localhost. Это значение может быть IP-адресом, например 203.0.113.0, или именем хоста, например example.com
zh: _APP_DOMAIN、_APP_DOMAIN_TARGET 和 _APP_DOMAIN_FUNCTIONS 环境变量尚未配置。请在通过任何 IP 地址或除 localhost 之外的主机名访问 Appwrite 控制台之前配置域环境变量。此值可以是 203.0.113.0 等 IP 或 example.com 等主机名

# general_usage_disabled
source: Usage stats are not configured. Please check the value of the _APP_USAGE_STATS environment variable of your Appwrite server
bn: ব্যবহার পরিসংখ্যান কনফিগার করা হয়নি। আপনার অ্যাপরাইট সার্ভারের _APP_USAGE_STATS পরিবেশ ভেরিয়েবলের মানটি পরীক্ষা করুন
de: Nutzungsstatistiken sind nicht konfiguriert. Bitte überprüfen Sie den Wert der Umgebungsvariablen _APP_USAGE_STATS Ihres Appwrite-Servers.
es: Las estadísticas de uso no están configuradas. Por favor, revisa el valor de la variable de entorno _APP_USAGE_STATS de tu servidor Appwrite
fr: Les statistiques d'utilisation ne sont pas configurées. Veuillez vérifier la valeur de la variable d'environnement _APP_USAGE_STATS de votre serveur Appwrite.
pl: Statystyki użytkowania nie są skonfigurowane. Sprawdź wartość zmiennej środowiskowej _APP_USAGE_STATS na serwerze Appwrite
pt: As estatísticas de uso não estão configuradas. Por favor, verifique o valor da variável de ambiente _APP_USAGE_STATS do seu servidor Appwrite
ru: Статистика использования не настроена. Пожалуйста, проверьте значение переменной среды _APP_USAGE_STATS вашего сервера Appwrite
zh: 未配置使用情况统计。请检查 Appwrite 服务器的 _APP_USAGE_STATS 环境变量的值

# project_provider_unsupported
source: The chosen OAuth provider is unsupported. Please check the Create OAuth2 Session docs for the complete list of supported OAuth providers
bn: নির্বাচিত ওএথ প্রোভাইডারটি সমর্থিত নয়। সমর্থিত ওএথ প্রোভাইডারের সম্পূর্ণ তালিকার জন্য তৈরি করুন OAuth2 সেশন ডকস দেখুন
de: Der ausgewählte OAuth-Anbieter wird nicht unterstützt. Die vollständige Liste der unterstützten OAuth-Anbieter finden Sie in den Create OAuth2 Session-Dokumenten.
es: El proveedor OAuth elegido no está soportado. Por favor, revisa la documentación de Crear Sesión OAuth2 para la lista completa de proveedores OAuth soportados
fr: Le fournisseur OAuth choisi n'est pas pris en charge. Veuillez consulter la documentation Créer une session OAuth2 pour obtenir la liste complète des fournisseurs OAuth pris en charge.
pl: Wybrany dostawca OAuth jest nieobsługiwany. Sprawdź dokumentację Utwórz sesję OAuth2, aby uzyskać pełną listę obsługiwanych dostawców OAuth
pt: O provedor OAuth escolhido não é suportado. Por favor, verifique a documentação Criar Sessão OAuth2 para a lista completa de provedores OAuth suportados
ru: Выбранный провайдер OAuth не поддерживается. Пожалуйста, проверьте документы по созданию сессии OAuth2 для полного списка поддерживаемых провайдеров OAuth
zh: 所选 OAuth 提供程序不受支持。请查看 OAuth2 会话文档以了解支持的 OAuth 提供程序的完整列表

# general_service_disabled
source: The requested service is disabled. You can enable the service from the Appwrite console
bn: অনুরোধিত পরিষেবাটি নিষ্ক্রিয়। আপনি অ্যাপরাইট কনসোল থেকে পরিষেবাটি সক্ষম করতে পারেন
de: Der angeforderte Dienst ist deaktiviert. Sie können den Dienst über die Appwrite-Konsole aktivieren.
es: El servicio solicitado está deshabilitado. Puedes habilitar el servicio desde la Consola Appwrite
fr: Le service demandé est désactivé. Vous pouvez activer le service depuis la console Appwrite.
pl: Żądana usługa jest wyłączona. Usługę można włączyć z poziomu konsoli Appwrite
pt: O serviço solicitado está desabilitado. Você pode habilitar o serviço no console do Appwrite
ru: Запрошенная служба отключена. Вы можете включить службу в консоли Appwrite
zh: 请求的服务已禁用。您可以从 Appwrite 控制台中启用该服务

# general_smtp_disabled
source: SMTP is disabled on your Appwrite instance. You can learn more about setting up SMTP in our docs
bn: আপনার অ্যাপরাইট ইনস্ট্যান্সে SMTP নিষ্ক্রিয়। আপনি আমাদের ডকসে SMTP সেটআপ সম্পর্কে আরও জানতে পারেন
de: SMTP ist auf Ihrer Appwrite-Instanz deaktiviert. Weitere Informationen zur Einrichtung von SMTP finden Sie in unserer Dokumentation.
es: SMTP está deshabilitado en tu instancia de Appwrite. Puedes aprender más sobre la configuración de SMTP en nuestra documentación
fr: SMTP est désactivé sur votre instance Appwrite. Vous pouvez en savoir plus sur la configuration de SMTP dans notre documentation.
pl: SMTP jest wyłączone w twojej instancji Appwrite. Dowiedz się więcej o konfigurowaniu SMTP w naszej dokumentacji
pt: SMTP está desabilitado na sua instância Appwrite. Você pode aprender mais sobre como configurar SMTP na nossa documentação
ru: SMTP отключен на вашем экземпляре Appwrite. Вы можете узнать больше о настройке SMTP в наших документах
zh: 您的 Appwrite 实例已禁用 SMTP。您可以在我们的文档中了解有关设置 SMTP 的更多信息

# general_phone_disabled
source: Phone provider is not configured. Please check the _APP_SMS_PROVIDER environment variable of your Appwrite server
bn: ফোন প্রোভাইডার কনফিগার করা হয়নি। আপনার অ্যাপরাইট সার্ভারের _APP_SMS_PROVIDER পরিবেশ ভেরিয়েবলটি পরীক্ষা করুন
de: Der Telefonanbieter ist nicht konfiguriert. Bitte überprüfen Sie die Umgebungsvariable _APP_SMS_PROVIDER Ihres Appwrite-Servers.
es: El proveedor de teléfono no está configurado. Por favor, revisa la variable de entorno _APP_SMS_PROVIDER de tu servidor Appwrite
fr: Le fournisseur de téléphone n'est pas configuré. Veuillez vérifier la variable d'environnement _APP_SMS_PROVIDER de votre serveur Appwrite.
pl: Dostawca telefonu nie jest skonfigurowany. Sprawdź zmienną środowiskową _APP_SMS_PROVIDER swojego serwera Appwrite
pt: O provedor de telefone não está configurado. Por favor, verifique a variável de ambiente _APP_SMS_PROVIDER do seu servidor Appwrite
ru: Телефонный провайдер не настроен. Пожалуйста, проверьте переменную среды _APP_SMS_PROVIDER вашего сервера Appwrite
zh: 未配置电话提供程序。请检查 Appwrite 服务器的 _APP_SMS_PROVIDER 环境变量

# user_password_mismatch
source: Passwords do not match. Please check the password and confirm password
bn: পাসওয়ার্ডগুলি মেলে না। পাসওয়ার্ড এবং নিশ্চিতকরণ পাসওয়ার্ড পরীক্ষা করুন
de: Die Passwörter stimmen nicht überein. Bitte überprüfen Sie das Passwort und das Bestätigungspasswort.
es: Las contraseñas no coinciden. Por favor, revisa la contraseña y la confirmación de contraseña
fr: Les mots de passe ne correspondent pas. Veuillez vérifier le mot de passe et le confirmer.
pl: Hasła nie pasują. Sprawdź hasło i potwierdź hasło
pt: As senhas não correspondem. Por favor, verifique a senha e confirme a senha
ru: Пароли не совпадают. Пожалуйста, проверьте пароль и подтверждение пароля
zh: 密码不匹配。请检查密码和确认密码

# password_recently_used
source: The password you are trying to use is similar to your previous password. For your security, please choose a different password and try again
bn: আপনি যে পাসওয়ার্ডটি ব্যবহার করার চেষ্টা করছেন তা আপনার পূর্ববর্তী পাসওয়ার্ডের মতো। আপনার নিরাপত্তার জন্য, অনুগ্রহ করে একটি ভিন্ন পাসওয়ার্ড নির্বাচন করুন এবং আবার চেষ্টা করুন
de: Das Passwort, das Sie verwenden möchten, ähnelt Ihrem vorherigen Passwort. Wählen Sie aus Sicherheitsgründen ein anderes Passwort und versuchen Sie es erneut.
es: La contraseña que estás intentando usar es similar a tu contraseña anterior. Por tu seguridad, por favor elige una contraseña diferente e intenta de nuevo
fr: Le mot de passe que vous essayez d'utiliser est similaire à votre mot de passe précédent. Pour votre sécurité, veuillez choisir un mot de passe différent et réessayer.
pl: Hasło, którego próbujesz użyć, jest podobne do twojego poprzedniego hasła. Ze względów bezpieczeństwa wybierz inne hasło i spróbuj ponownie
pt: A senha que você está tentando usar é similar à sua senha anterior. Para sua segurança, por favor, escolha uma senha diferente e tente novamente
ru: Пароль, который вы пытаетесь использовать, похож на ваш предыдущий пароль. Для вашей безопасности, пожалуйста, выберите другой пароль и повторите попытку
zh: 您尝试使用的密码与您之前的密码相似。为了您的安全，请选择不同的密码并重试
