Repository: LynxLynxx/appwrite_error_handling
Catalog: lib/l10n/intl_*.arb
Languages: ar, bn, de, es, fr, pl, pt, ru, zh

# password_personal_data
source: The password you are trying to use contains references to your name, email, phone or userID. For your security, please choose a different password and try again
bn: আপনি যে পাসওয়ার্ডটি ব্যবহার করার চেষ্টা করছেন তাতে আপনার নাম, ইমেল, ফোন বা ইউজারআইডি-র রেফারেন্স রয়েছে। আপনার নিরাপত্তার জন্য, অনুগ্রহ করে একটি ভিন্ন পাসওয়ার্ড নির্বাচন করুন এবং আবার চেষ্টা করুন
de: Das Passwort, das Sie verwenden möchten, enthält Verweise auf Ihren Namen, Ihre E-Mail-Adresse, Ihr Telefon oder Ihre Benutzer-ID. Wählen Sie aus Sicherheitsgründen ein anderes Passwort und versuchen Sie es erneut.
es: La contraseña que estás intentando usar contiene referencias a tu nombre, email, teléfono o userID. Por tu seguridad, por favor elige una contraseña diferente e intenta de nuevo
fr: Le mot de passe que vous essayez d'utiliser contient des références à votre nom, votre adresse e-mail, votre téléphone ou votre ID utilisateur. Pour votre sécurité, veuillez choisir un mot de passe différent et réessayer.
pl: Hasło, którego próbujesz użyć, zawiera odniesienia do twojego imienia, e-maila, telefonu lub identyfikatora użytkownika. Ze względów bezpieczeństwa wybierz inne hasło i spróbuj ponownie
pt: A senha que você está tentando usar contém referências ao seu nome, email, telefone ou userID. Para sua segurança, por favor, escolha uma senha diferente e tente novamente
ru: Пароль, который вы пытаетесь использовать, содержит ссылки на ваше имя, электронную почту, телефон или ID пользователя. Для вашей безопасности, пожалуйста, выберите другой пароль и повторите попытку
zh: 您尝试使用的密码包含您的姓名、电子邮件、电话或 userID 的信息。为了您的安全，请选择不同的密码并重试

# user_phone_not_found
source: The current user does not have a phone number associated with their account
bn: বর্তমান ব্যবহারকারীর অ্যাকাউন্টের সাথে সংযুক্ত কোন ফোন নম্বর নেই
de: Der aktuelle Benutzer hat keine Telefonnummer mit seinem Konto verknüpft.
es: El usuario actual no tiene un número de teléfono asociado a su cuenta
fr: L'utilisateur actuel n'a pas de numéro de téléphone associé à son compte.
pl: Aktualny użytkownik nie ma numeru telefonu powiązanego z kontem
pt: O usuário atual não tem um número de telefone associado à sua conta
ru: У текущего пользователя нет номера телефона, связанного с его аккаунтом
zh: 当前用户没有与其帐户关联的电话号码

# user_missing_id
source: Missing ID from OAuth2 provider
bn: OAuth2 প্রোভাইডার থেকে আইডি অনুপস্থিত
de: Fehlende ID vom OAuth2-Anbieter
es: Falta el ID del proveedor OAuth2
fr: ID manquant du fournisseur OAuth2
pl: Brakujące identyfikatory od dostawcy OAuth2
pt: ID ausente do provedor OAuth2
ru: Отсутствует ID от провайдера OAuth2
zh: 缺少 OAuth2 提供程序的 ID

# user_oauth2_bad_request
source: OAuth2 provider rejected the bad request
bn: OAuth2 প্রোভাইডার খারাপ অনুরোধটি প্রত্যাখ্যান করেছে
de: Der OAuth2-Anbieter hat die ungültige Anfrage abgelehnt.
es: El proveedor OAuth2 rechazó la solicitud incorrecta
fr: Le fournisseur OAuth2 a rejeté la requête incorrecte.
pl: Dostawca OAuth2 odrzucił błędne żądanie
pt: O provedor OAuth2 rejeitou a solicitação inválida
ru: Провайдер OAuth2 отклонил неверный запрос
zh: OAuth2 提供程序拒绝了错误的请求

# user_jwt_invalid
source: The JWT token is invalid. Please check the value of the X-Appwrite-JWT header to ensure the correct token is being used
bn: JWT টোকেনটি অবৈধ। সঠিক টোকেনটি ব্যবহার করা হচ্ছে তা নিশ্চিত করতে X-Appwrite-JWT হেডারের মানটি পরীক্ষা করুন
de: Das JWT-Token ist ungültig. Überprüfen Sie den Wert des X-Appwrite-JWT-Headers, um sicherzustellen, dass das richtige Token verwendet wird.
es: El token JWT es inválido. Por favor, revisa el valor del encabezado X-Appwrite-JWT para asegurar que se está usando el token correcto
fr: Le jeton JWT n'est pas valide. Veuillez vérifier la valeur de l'en-tête X-Appwrite-JWT pour vous assurer que le bon jeton est utilisé.
pl: Token JWT jest nieprawidłowy. Sprawdź poprawność nagłówka X-Appwrite-JWT, aby upewnić się, że używany jest prawidłowy token
pt: O token JWT é inválido. Por favor, verifique o valor do cabeçalho X-Appwrite-JWT para garantir que o token correto está sendo usado
ru: Токен JWT недействителен. Пожалуйста, проверьте значение заголовка X-Appwrite-JWT, чтобы убедиться, что используется правильный токен
zh: JWT 令牌无效。请检查 X-Appwrite-JWT 标头值以确保使用正确的令牌

# user_blocked
source: The current user has been blocked. You can unblock the user by making a request to the User API's Update User Status endpoint or in the Appwrite Console's Auth section
bn: বর্তমান ব্যবহারকারীকে ব্লক করা হয়েছে। আপনি ব্যবহারকারী API এর ব্যবহারকারী স্ট্যাটাস আপডেট এন্ডপয়েন্টে একটি অনুরোধ করে বা অ্যাপরাইট কনসোলের অথ বিভাগে ব্যবহারকারী अनब्लॉक করতে পারেন
de: Der aktuelle Benutzer wurde gesperrt. Sie können den Benutzer entsperren, indem Sie eine Anfrage an den Update User Status-Endpunkt der User-API oder im Auth-Bereich der Appwrite-Konsole stellen.
es: El usuario actual ha sido bloqueado. Puedes desbloquear al usuario realizando una solicitud al extremo Actualizar Estado de Usuario de la API de Usuario o en la sección de Autenticación de la Consola Appwrite
fr: L'utilisateur actuel a été bloqué. Vous pouvez débloquer l'utilisateur en effectuant une requête vers le point de terminaison Mettre à jour le statut de l'utilisateur de l'API Utilisateur ou dans la section Authentification de la console Appwrite.
pl: Aktualny użytkownik został zablokowany. Możesz odblokować użytkownika, wysyłając żądanie do punktu końcowego Aktualizacja statusu użytkownika API użytkownika lub w sekcji Uwierzytelnianie w Konsoli Appwrite
pt: O usuário atual foi bloqueado. Você pode desbloquear o usuário fazendo uma solicitação ao endpoint Atualizar Status do Usuário da API do Usuário ou na seção Autenticação do Console do Appwrite
ru: Текущий пользователь был заблокирован. Вы можете разблокировать пользователя, сделав запрос к конечной точке обновления статуса пользователя API пользователя или в разделе аутентификации консоли Appwrite
zh: 当前用户已被阻止。您可以通过向 User API 的更新用户状态端点发送请求或在 Appwrite 控制台的 Auth 部分中取消阻止用户

# user_invalid_token
source: Invalid token passed in the request
bn: অনুরোধে অবৈধ টোকেন পাস করা হয়েছে
de: Ungültiges Token in der Anfrage übergeben.
es: Token inválido pasado en la solicitud
fr: Jeton invalide transmis dans la requête.
pl: Podany w żądaniu token jest nieprawidłowy
pt: Token inválido passado na solicitação
ru: Недействительный токен, переданный в запросе
zh: 请求中传递了无效令牌

# user_email_not_whitelisted
source: Console registration is restricted to specific emails. Contact your administrator for more information
bn: কনসোল নিবন্ধন নির্দিষ্ট ইমেলগুলিতে সীমাবদ্ধ। আরও তথ্যের জন্য আপনার অ্যাডমিনিস্ট্রেটরের সাথে যোগাযোগ করুন
de: Die Konsolenregistrierung ist auf bestimmte E-Mails beschränkt. Wenden Sie sich an Ihren Administrator, um weitere Informationen zu erhalten.
es: El registro en la Consola está restringido a emails específicos. Contacta con tu administrador para más información
fr: L'enregistrement dans la console est réservé à des e-mails spécifiques. Contactez votre administrateur pour plus d'informations.
pl: Rejestracja w Konsoli jest ograniczona do określonych adresów e-mail. Skontaktuj się z administratorem, aby uzyskać więcej informacji
pt: O registro do console está restrito a emails específicos. Entre em contato com seu administrador para mais informações
ru: Регистрация в консоли ограничена определенными электронными письмами. Обратитесь к своему администратору для получения дополнительной информации
zh: 控制台注册仅限于特定电子邮件。请联系管理员以了解更多信息

# user_invalid_code
source: The specified code is not valid. Contact your administrator for more information
bn: নির্দিষ্ট কোডটি বৈধ নয়। আরও তথ্যের জন্য আপনার অ্যাডমিনিস্ট্রেটরের সাথে যোগাযোগ করুন
de: Der angegebene Code ist ungültig. Wenden Sie sich an Ihren Administrator, um weitere Informationen zu erhalten.
es: El código especificado no es válido. Contacta con tu administrador para más información
fr: Le code spécifié n'est pas valide. Contactez votre administrateur pour plus d'informations.
pl: Określony kod jest nieprawidłowy. Skontaktuj się z administratorem, aby uzyskać więcej informacji
pt: O código especificado não é válido. Entre em contato com seu administrador para mais informações
ru: Указанный код недействителен. Обратитесь к своему администратору для получения дополнительной информации
zh: 指定的代码无效。请联系管理员以了解更多信息

# user_ip_not_whitelisted
source: Console registration is restricted to specific IPs. Contact your administrator for more information
bn: কনসোল নিবন্ধন নির্দিষ্ট আইপিতে সীমাবদ্ধ। আরও তথ্যের জন্য আপনার অ্যাডমিনিস্ট্রেটরের সাথে যোগাযোগ করুন
de: Die Konsolenregistrierung ist auf bestimmte IPs beschränkt. Wenden Sie sich an Ihren Administrator, um weitere Informationen zu erhalten.
es: El registro en la Consola está restringido a IPs específicas. Contacta con tu administrador para más información
fr: L'enregistrement dans la console est réservé à des adresses IP spécifiques. Contactez votre administrateur pour plus d'informations.
pl: Rejestracja w Konsoli jest ograniczona do określonych adresów IP. Skontaktuj się z administratorem, aby uzyskać więcej informacji
pt: O registro do console está restrito a IPs específicos. Entre em contato com seu administrador para mais informações
ru: Регистрация в консоли ограничена определенными IP-адресами. Обратитесь к своему администратору для получения дополнительной информации
zh: 控制台注册仅限于特定 IP。请联系管理员以了解更多信息

# user_invalid_credentials
source: Invalid credentials. Please check the email and password
bn: অবৈধ credentials। দয়া করে ইমেল এবং পাসওয়ার্ড পরীক্ষা করুন
de: Ungültige Anmeldeinformationen. Bitte überprüfen Sie die E-Mail-Adresse und das Passwort.
es: Credenciales inválidas. Por favor, revisa el email y la contraseña
fr: Identifiants non valides. Veuillez vérifier l'e-mail et le mot de passe.
pl: Nieprawidłowe poświadczenia. Sprawdź poprawność adresu e-mail i hasła
pt: Credenciais inválidas. Por favor, verifique o email e a senha
ru: Неверные учетные данные. Пожалуйста, проверьте email и пароль
zh: 无效的凭据。请检查电子邮件和密码

# user_anonymous_console_prohibited
source: Anonymous users cannot be created for the console project
bn: কনসোল প্রকল্পের জন্য অজ্ঞাত ব্যবহারকারী তৈরি করা যায় না
de: Anonyme Benutzer können nicht für das Konsolenprojekt erstellt werden.
es: No se pueden crear usuarios anónimos para el proyecto de la consola
fr: Les utilisateurs anonymes ne peuvent pas être créés pour le projet de la console.
pl: Użytkownicy anonimowi nie mogą być tworzeni dla projektu konsoli
pt: Usuários anônimos não podem ser criados para o projeto do console
ru: Анонимные пользователи не могут быть созданы для проекта консоли
zh: 无法为控制台项目创建匿名用户

# user_session_already_exists
source: Creation of anonymous users is prohibited when a session is active
bn: একটি সেশন সক্রিয় থাকাকালীন অজ্ঞাত ব্যবহারকারী তৈরি নিষিদ্ধ
de: Die Erstellung anonymer Benutzer ist verboten, wenn eine Sitzung aktiv ist.
es: La creación de usuarios anónimos está prohibida cuando una sesión está activa
fr: La création d'utilisateurs anonymes est interdite lorsqu'une session est active.
pl: Tworzenie użytkowników anonimowych jest zabronione, gdy aktywna jest sesja
pt: A criação de usuários anônimos é proibida quando uma sessão está ativa
ru: Создание анонимных пользователей запрещено, когда сессия активна
zh: 会话活动时禁止创建匿名用户

# user_unauthorized
source: The current user is not authorized to perform the requested action
bn: বর্তমান ব্যবহারকারী অনুরোধিত ক্রিয়াটি সম্পাদন করার অনুমতিপ্রাপ্ত নয়
de: Der aktuelle Benutzer ist nicht berechtigt, die angeforderte Aktion auszuführen.
es: El usuario actual no está autorizado para realizar la acción solicitada
fr: L'utilisateur actuel n'est pas autorisé à effectuer l'action demandée.
pl: Bieżący użytkownik nie jest upoważniony do wykonania żądanej akcji
pt: O usuário atual não está autorizado a executar a ação solicitada
ru: Текущий пользователь не уполномочен выполнять требуемое действие
zh: 当前用户无权执行请求的操作

# user_oauth2_unauthorized
source: OAuth2 provider rejected the unauthorized request
bn: OAuth2 প্রোভাইডার অননুমোদিত অনুরোধটি প্রত্যাখ্যান করেছে
de: Der OAuth2-Anbieter hat die nicht autorisierte Anfrage abgelehnt.
es: El proveedor OAuth2 rechazó la solicitud no autorizada
fr: Le fournisseur OAuth2 a rejeté la requête non autorisée.
pl: Dostawca OAuth2 odrzucił nieautoryzowane żądanie
pt: O provedor OAuth2 rejeitou a solicitação não autorizada
ru: Провайдер OAuth2 отклонил неавторизованный запрос
zh: OAuth2 提供程序拒绝了未经授权的请求

# team_invalid_secret
source: The team invitation secret is invalid. Please request a new invitation and try again
bn: টিমের আমন্ত্রণ গোপনটি অবৈধ। দয়া করে একটি নতুন আমন্ত্রণের জন্য অনুরোধ করুন এবং আবার চেষ্টা করুন
de: Das Teameinladungsgeheimnis ist ungültig. Bitte fordern Sie eine neue Einladung an und versuchen Sie es erneut.
es: El secreto de invitación al equipo es inválido. Por favor, solicita una nueva invitación e intenta de nuevo
fr: Le secret d'invitation à l'équipe n'est pas valide. Veuillez demander une nouvelle invitation et réessayer.
pl: Sekret zaproszenia do zespołu jest nieprawidłowy. Poproś o nowe zaproszenie i spróbuj ponownie
pt: O segredo do convite da equipe é inválido. Por favor, solicite um novo convite e tente novamente
ru: Секретный ключ приглашения в команду недействителен. Пожалуйста, запросите новое приглашение и повторите попытку
zh: 团队邀请密钥无效。请请求新的邀请并重试

# team_invite_mismatch
source: The invite does not belong to the current user
bn: আমন্ত্রণটি বর্তমান ব্যবহারকারীর অন্তর্গত নয়
de: Die Einladung gehört nicht zum aktuellen Benutzer.
es: La invitación no pertenece al usuario actual
fr: L'invitation n'appartient pas à l'utilisateur actuel.
pl: Zaproszenie nie należy do bieżącego użytkownika
pt: O convite não pertence ao usuário atual
ru: Приглашение не принадлежит текущему пользователю
zh: 邀请不属于当前用户

# user_not_found
source: User with the requested ID could not be found
bn: অনুরোধিত আইডি সহ ব্যবহারকারী পাওয়া যায়নি
de: Benutzer mit der angeforderten ID konnte nicht gefunden werden.
es: No se encontró el usuario con el ID solicitado
fr: L'utilisateur avec l'ID demandé est introuvable.
pl: Nie można znaleźć użytkownika o żądanym identyfikatorze
pt: Usuário com o ID solicitado não foi encontrado
ru: Пользователь с запрошенным ID не найден
zh: 找不到具有请求的 ID 的用户

# user_session_not_found
source: The current user session could not be found
bn: বর্তমান ব্যবহারকারীর সেশনটি পাওয়া যায়নি
de: Die Sitzung des aktuellen Benutzers konnte nicht gefunden werden.
es: No se encontró la sesión del usuario actual
fr: La session utilisateur actuelle est introuvable.
pl: Nie można znaleźć bieżącej sesji użytkownika
pt: A sessão do usuário atual não foi encontrada
ru: Текущая сессия пользователя не найдена
zh: 找不到当前用户会话

# user_identity_not_found
source: The identity could not be found. Please sign in with OAuth provider to create identity first
bn: identitiটি পাওয়া যায়নি। প্রথমে identiti তৈরি করতে OAuth প্রোভাইডারে সাইন ইন করুন
de: Die Identität konnte nicht gefunden werden. Bitte melden Sie sich mit dem OAuth-Anbieter an, um zuerst eine Identität zu erstellen.
es: No se encontró la identidad. Por favor, inicia sesión con el proveedor OAuth para crear la identidad primero
fr: L'identité est introuvable. Veuillez vous connecter avec le fournisseur OAuth pour créer l'identité en premier.
pl: Nie można znaleźć tożsamości. Zaloguj się za pomocą dostawcy OAuth, aby najpierw utworzyć tożsamość
pt: A identidade não foi encontrada. Por favor, faça login com o provedor OAuth para criar identidade primeiro
ru: Идентификатор не найден. Пожалуйста, войдите с помощью провайдера OAuth, чтобы сначала создать идентификатор
zh: 找不到身份。请使用 OAuth 提供程序登录以首先创建身份

# team_not_found
source: Team with the requested ID could not be found
bn: অনুরোধিত আইডি সহ টিমটি পাওয়া যায়নি
de: Team mit der angeforderten ID konnte nicht gefunden werden.
es: No se encontró el equipo con el ID solicitado
fr: L'équipe avec l'ID demandé est introuvable.
pl: Nie można znaleźć zespołu o żądanym identyfikatorze
pt: Equipe com o ID solicitado não foi encontrada
ru: Команда с запрошенным ID не найдена
zh: 找不到具有请求的 ID 的团队

# team_invite_not_found
source: The requested team invitation could not be found
bn: অনুরোধিত টিম আমন্ত্রণটি পাওয়া যায়নি
de: Die angeforderte Teameinladung konnte nicht gefunden werden.
es: No se encontró la invitación al equipo solicitada
fr: L'invitation d'équipe demandée est introuvable.
pl: Nie można znaleźć żądanego zaproszenia do zespołu
pt: O convite de equipe solicitado não foi encontrado
ru: Запрошенное приглашение в команду не найдено
zh: 找不到请求的团队邀请

# team_membership_mismatch
source: The membership ID does not belong to the team ID
bn: সদস্যপদ আইডিটি টিম আইডির অন্তর্গত নয়
de: Die Mitgliedschafts-ID gehört nicht zur Team-ID.
es: El ID de miembro no pertenece al ID de equipo
fr: L'ID d'adhésion n'appartient pas à l'ID d'équipe.
pl: Identyfikator członkostwa nie należy do identyfikatora zespołu
pt: O ID da membresia não pertence ao ID da equipe
ru: ID членства не принадлежит ID команды
zh: 成员资格 ID 不属于团队 ID

# membership_not_found
source: Membership with the requested ID could not be found
bn: অনুরোধিত আইডি সহ সদস্যপদটি পাওয়া যায়নি
de: Mitgliedschaft mit der angeforderten ID konnte nicht gefunden werden.
es: No se encontró la membresía con el ID solicitado
fr: L'adhésion avec l'ID demandé est introuvable.
pl: Nie można znaleźć członkostwa o żądanym identyfikatorze
pt: Membresia com o ID solicitado não foi encontrada
ru: Членство с запрошенным ID не найдено
zh: 找不到具有请求的 ID 的成员资格

# user_already_exists
source: A user with the same id, email, or phone already exists in this project
bn: এই প্রকল্পে ইতিমধ্যেই একই আইডি, ইমেল বা ফোন নম্বর সহ একজন ব্যবহারকারী বিদ্যমান রয়েছে
de: Ein Benutzer mit derselben ID, E-Mail-Adresse oder Telefonnummer ist bereits in diesem Projekt vorhanden.
es: Un usuario con el mismo id, email o teléfono ya existe en este proyecto
fr: Un utilisateur avec le même identifiant, la même adresse e-mail ou le même téléphone existe déjà dans ce projet.
pl: Użytkownik z takim samym identyfikatorem, adresem e-mail lub numerem telefonu już istnieje w tym projekcie
pt: Um usuário com o mesmo id, email ou telefone já existe neste projeto
ru: Пользователь с тем же ID, email или телефоном уже существует в этом проекте
zh: 此项目中已存在具有相同 ID、电子邮件或电话的用户

# user_email_already_exists
source: A user with the same email already exists in the current project
bn: বর্তমান প্রকল্পে ইতিমধ্যেই একই ইমেল সহ একজন ব্যবহারকারী বিদ্যমান রয়েছে
de: Ein Benutzer mit derselben E-Mail-Adresse ist bereits im aktuellen Projekt vorhanden.
es: Un usuario con el mismo email ya existe en el proyecto actual
fr: Un utilisateur avec la même adresse e-mail existe déjà dans le projet actuel.
pl: Użytkownik o takim samym adresie e-mail już istnieje w bieżącym projekcie
pt: Um usuário com o mesmo email já existe no projeto atual
ru: Пользователь с тем же email уже существует в этом проекте
zh: 此项目中已存在具有相同电子邮件的用户

# user_phone_already_exists
source: A user with the same phone number already exists in the current project
bn: বর্তমান প্রকল্পে ইতিমধ্যেই একই ফোন নম্বর সহ একজন ব্যবহারকারী বিদ্যমান রয়েছে
de: Ein Benutzer mit derselben Telefonnummer ist bereits im aktuellen Projekt vorhanden.
es: Un usuario con el mismo número de teléfono ya existe en el proyecto actual
fr: Un utilisateur avec le même numéro de téléphone existe déjà dans le projet actuel.
pl: Użytkownik o takim samym numerze telefonu już istnieje w bieżącym projekcie
pt: Um usuário com o mesmo número de telefone já existe no projeto atual
ru: Пользователь с тем же номером телефона уже существует в этом проекте
zh: 此项目中已存在具有相同电话号码的用户

# team_invite_already_exists
source: User has already been invited or is already a member of this team
bn: ব্যবহারকারীকে ইতিমধ্যে আমন্ত্রণ জানানো হয়েছে বা ইতিমধ্যেই এই টিমের সদস্য
de: Benutzer wurde bereits eingeladen oder ist bereits Mitglied dieses Teams.
es: El usuario ya ha sido invitado o ya es miembro de este equipo
fr: L'utilisateur a déjà été invité ou est déjà membre de cette équipe.
pl: Użytkownik został już zaproszony lub jest już członkiem tego zespołu
pt: O usuário já foi convidado ou já é membro desta equipe
ru: Пользователь уже был приглашен или является членом этой команды
zh: 用户已被邀请或已经是该团队的成员

# team_already_exists
source: Team with the requested ID already exists. Please choose a different ID and try again
ar: فريق مع معرف المطلوب موجود بالفعل. الرجاء اختيار معرف مختلف وإعادة المحاولة
bn: আপনার নির্বাচিত আইডি দিয়ে টিমটি ইতিমধ্যেই বিদ্যমান। অনুগ্রহ করে ভিন্ন আইডি নির্বাচন করুন এবং আবার চেষ্টা করুন
de: Team mit der angeforderten ID existiert bereits. Bitte wähle eine andere ID und versuche es erneut
es: El equipo con la ID solicitada ya existe. Por favor, elija una ID diferente e inténtelo de nuevo
fr: Une équipe avec l'identifiant demandé existe déjà. Veuillez choisir un identifiant différent et réessayer
pl: Zespół o podanym ID już istnieje. Wybierz inny ID i spróbuj ponownie
pt: A equipe com a ID solicitada já existe. Por favor escolha uma ID diferente e tente novamente
ru: Команда с запрошенным идентификатором уже существует. Пожалуйста, выберите другой идентификатор и попробуйте снова
zh: 该团队 ID 已存在，请使用不同的 ID 重新尝试

# membership_already_confirmed
source: Membership is already confirmed
ar: عضوية مؤكدة بالفعل
bn: সদস্যতার অনুমোদন ইতিমধ্যেই দেওয়া হয়েছে
de: Mitgliedschaft ist bereits bestätigt
es: La membresía ya está confirmada
fr: L'adhésion est déjà confirmée
pl: Członkostwo jest już potwierdzone
pt: A membresia já está confirmada
ru: Членство уже подтверждено
zh: 该用户身份已确认

# user_password_reset_required
source: The current user requires a password reset
ar: المستخدم الحالي بحاجة إلى إعادة تعيين كلمة المرور
bn: বর্তমান ব্যবহারকারীকে পাসওয়ার্ড রিসেট করার প্রয়োজন
de: Der aktuelle Benutzer benötigt eine Passwortzurücksetzung
es: El usuario actual requiere un restablecimiento de contraseña
fr: L'utilisateur actuel doit réinitialiser son mot de passe
pl: Bieżący użytkownik wymaga zresetowania hasła
pt: O usuário atual precisa redefinir sua senha
ru: Текущему пользователю требуется сброс пароля
zh: 当前用户需要重置密码

# user_oauth2_provider_error
source: OAuth2 provider returned some error
ar: مقدم OAuth2 أرجع بعض الأخطاء
bn: OAuth2 প্রদানকারী কিছু ত্রুটি প্রদান করেছে
de: OAuth2-Anbieter hat einen Fehler zurückgegeben
es: El proveedor de OAuth2 devolvió un error
fr: Le fournisseur OAuth2 a renvoyé une erreur
pl: Dostawca OAuth2 zwrócił błąd
pt: O provedor OAuth2 retornou um erro
ru: Провайдер OAuth2 вернул ошибку
zh: OAuth2 认证提供商返回错误

# user_count_exceeded
source: The current project has exceeded the maximum number of users. Please check your user limit in the Appwrite console
ar: لقد تجاوز المشروع الحالي الحد الأقصى لعدد المستخدمين. يرجى التحقق من حد المستخدمين في وحدة التحكم Appwrite.
bn: বর্তমান প্রকল্পে ব্যবহারকারীর সর্বোচ্চ সংখ্যা অতিক্রম করা হয়েছে। অনুগ্রহ করে Appwrite কনসোলে আপনার ব্যবহারকারীর সীমা পরীক্ষা করুন
de: Das aktuelle Projekt hat die maximale Anzahl an Benutzern überschritten. Bitte überprüfe dein Benutzerlimit in der Appwrite-Konsole
es: El proyecto actual ha excedido el número máximo de usuarios. Por favor, revise su límite de usuarios en la consola de Appwrite
fr: Le projet actuel a dépassé le nombre maximum d'utilisateurs. Veuillez vérifier votre limite d'utilisateurs dans la console Appwrite
pl: Bieżący projekt przekroczył maksymalną liczbę użytkowników. Sprawdź limit użytkowników w konsoli Appwrite
pt: O projeto atual excedeu o limite máximo de usuários. Por favor verifique o limite de usuários no console Appwrite
ru: Текущий проект превысил максимальное количество пользователей. Пожалуйста, проверьте лимит пользователей в консоли Appwrite
zh: 该项目已达到最大用户数限制，请在 Appwrite 控制面板查看您的用户限制
